From 32a6ab931a258aa8d1fceb7a3758c25d7af68023 Mon Sep 17 00:00:00 2001
From: =?UTF-8?q?Renaud=20M=C3=A9trich?= <rmetrich@redhat.com>
Date: Mon, 16 May 2022 08:30:43 +0200
Subject: [PATCH 1/6] Fix typo in --import description
MIME-Version: 1.0
Content-Type: text/plain; charset=UTF-8
Content-Transfer-Encoding: 8bit

Signed-off-by: Renaud Métrich <rmetrich@redhat.com>
---
 src/efivar.c | 2 +-
 1 file changed, 1 insertion(+), 1 deletion(-)

diff --git a/src/efivar.c b/src/efivar.c
index 09f85edd..1ab7c397 100644
--- a/src/efivar.c
+++ b/src/efivar.c
@@ -447,7 +447,7 @@ usage(int ret)
 		"  -a, --append                      append to variable specified by --name\n"
 		"  -f, --datafile=<file>             load or save variable contents from <file>\n"
 		"  -e, --export=<file>               export variable to <file>\n"
-		"  -i, --import=<file>               import variable from <file\n"
+		"  -i, --import=<file>               import variable from <file>\n"
 		"  -L, --list-guids                  show internal guid list\n"
 		"  -w, --write                       write to variable specified by --name\n\n"
 		"Help options:\n"

From 4751a359ac46e08b688997ef6969213c687dd4bf Mon Sep 17 00:00:00 2001
From: =?UTF-8?q?Renaud=20M=C3=A9trich?= <rmetrich@redhat.com>
Date: Mon, 16 May 2022 08:35:25 +0200
Subject: [PATCH 2/6] Implement Uri device path
MIME-Version: 1.0
Content-Type: text/plain; charset=UTF-8
Content-Transfer-Encoding: 8bit


+efi_generate_ipv4_device_path(uint8_t *buf, ssize_t size,
+			      const char * const ifname,
+			      const char * const local_addr,
+			      const char * const remote_addr,
+			      const char * const gateway_addr,
+			      const char * const netmask,
+			      uint16_t local_port,
+			      uint16_t remote_port,
+			      uint16_t protocol,
+			      uint8_t addr_origin)
+{
+	return efi_generate_ipv4_device_path_with_uri(buf, size, ifname,
+			local_addr, remote_addr, gateway_addr, netmask,
+			local_port, remote_port, protocol, addr_origin,
+			NULL);
+}
+
 uint32_t PUBLIC
 efi_get_libefiboot_version(void)
 {
diff --git a/src/dp-message.c b/src/dp-message.c
index 9ae5d34d..4fe579e6 100644
--- a/src/dp-message.c
+++ b/src/dp-message.c
@@ -638,6 +638,25 @@ efidp_make_mac_addr(uint8_t *buf, ssize_t size, uint8_t if_type,
 	return sz;
 }
 
+ssize_t NONNULL(3) PUBLIC
+efidp_make_uri(uint8_t *buf, ssize_t size, const char * const uristring)
+{
+	efidp_uri *uri = (efidp_uri *)buf;
+	size_t urilen = strlen(uristring);
+	ssize_t req = offsetof(efidp_uri, uri) + urilen;
+
+	ssize_t sz = efidp_make_generic(buf, size, EFIDP_MESSAGE_TYPE,
+					EFIDP_MSG_URI, req);
+	if (size && sz == req) {
+		memcpy(uri->uri, (uint8_t *)uristring, urilen);
+	}
+
+	if (sz < 0)
+		efi_error("efidp_make_generic failed");
+
+	return sz;
+}
+
 ssize_t PUBLIC
 efidp_make_ipv4(uint8_t *buf, ssize_t size, uint32_t local, uint32_t remote,
 		uint32_t gateway, uint32_t netmask,
diff --git a/src/include/efivar/efiboot-creator.h b/src/include/efivar/efiboot-creator.h
index 175417db..d6084a13 100644
--- a/src/include/efivar/efiboot-creator.h
+++ b/src/include/efivar/efiboot-creator.h
@@ -47,6 +47,21 @@ extern ssize_t efi_generate_ipv4_device_path(uint8_t *buf, ssize_t size,
 	__attribute__((__nonnull__ (3,4,5,6,7)))
 	__attribute__((__visibility__ ("default")));
 
+extern ssize_t efi_generate_ipv4_device_path_with_uri(
+				     uint8_t *buf, ssize_t size,
+				     const char * const ifname,
+				     const char * const local_addr,
+				     const char * const remote_addr,
+				     const char * const gateway_addr,
+				     const char * const netmask,
+				     uint16_t local_port,
+				     uint16_t remote_port,
+				     uint16_t protocol,
+				     uint8_t addr_origin,
+				     const char * const uri)
+	__attribute__((__nonnull__ (3,4,5,6,7)))
+	__attribute__((__visibility__ ("default")));
+
 #ifdef __cplusplus
 } /* extern "C" */
 #endif
diff --git a/src/include/efivar/efivar-dp.h b/src/include/efivar/efivar-dp.h
index bfbf874a..517fe776 100644
--- a/src/include/efivar/efivar-dp.h
+++ b/src/include/efivar/efivar-dp.h
@@ -651,6 +651,8 @@ typedef struct {
 	efidp_header	header;
 	uint8_t		uri[];
 } EFIVAR_PACKED efidp_uri;
+extern ssize_t efidp_make_uri(uint8_t *buf, ssize_t size,
+			      const char * const uristring);
 
 #define EFIDP_MSG_UFS		0x19
 typedef struct {

From 08459a04f587e1345b749616a6d2005db43457ce Mon Sep 17 00:00:00 2001
From: =?UTF-8?q?Renaud=20M=C3=A9trich?= <rmetrich@redhat.com>
Date: Mon, 16 May 2022 08:36:28 +0200
Subject: [PATCH 3/6] Bump version to 39 for libefivar and to 32 for libefiboot
MIME-Version: 1.0
Content-Type: text/plain; charset=UTF-8
Content-Transfer-Encoding: 8bit

Signed-off-by: Renaud Métrich <rmetrich@redhat.com>
---
 src/include/version.mk |    2 +-
 src/libefiboot.abixml  |  828 +++++++++++-----------
 src/libefiboot.map.in  |    4 +
 src/libefisec.abixml   |  124 ++--
 src/libefivar.abixml   | 1500 ++++++++++++++++++++--------------------
 src/libefivar.map.in   |    4 +
 6 files changed, 1250 insertions(+), 1212 deletions(-)

diff --git a/src/include/version.mk b/src/include/version.mk
index eeaf6c59..ae55d310 100644
--- a/src/include/version.mk
+++ b/src/include/version.mk
@@ -1 +1 @@
-VERSION=38
+VERSION=39
diff --git a/src/libefiboot.abixml b/src/libefiboot.abixml
index 07e89a82..04b41495 100644
--- a/src/libefiboot.abixml
+++ b/src/libefiboot.abixml
@@ -7,6 +7,7 @@
     <elf-symbol name='efi_generate_file_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efi_generate_file_device_path_from_esp' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efi_generate_ipv4_device_path' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
+    <elf-symbol name='efi_generate_ipv4_device_path_with_uri' version='LIBEFIBOOT_1.32' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efi_get_libefiboot_version' version='LIBEFIBOOT_1.31' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efi_loadopt_args_as_ucs2' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efi_loadopt_args_as_utf8' version='libefiboot.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
@@ -68,24 +69,24 @@
     <type-decl name='unsigned short int' size-in-bits='16' id='type-id-28'/>
     <type-decl name='variadic parameter type' id='type-id-29'/>
     <type-decl name='void' id='type-id-30'/>
-    <class-decl name='efi_guid_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-types.h' line='13' column='1' id='type-id-32'>
+    <class-decl name='efi_guid_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-types.h' line='17' column='1' id='type-id-32'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='a' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-types.h' line='14' column='1'/>
+        <var-decl name='a' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='b' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-types.h' line='15' column='1'/>
+        <var-decl name='b' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-types.h' line='19' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='c' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-types.h' line='16' column='1'/>
+        <var-decl name='c' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-types.h' line='20' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='d' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-types.h' line='17' column='1'/>
+        <var-decl name='d' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-types.h' line='21' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='e' type-id='type-id-22' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
+        <var-decl name='e' type-id='type-id-22' visibility='default' filepath='src/include/efivar/efivar-types.h' line='22' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_guid_t' type-id='type-id-32' filepath='src/include/efivar/efivar-types.h' line='19' column='1' id='type-id-31'/>
+    <typedef-decl name='efi_guid_t' type-id='type-id-32' filepath='src/include/efivar/efivar-types.h' line='23' column='1' id='type-id-31'/>
     <class-decl name='acpi_root_info' size-in-bits='384' is-struct='yes' visibility='default' filepath='src/linux.h' line='18' column='1' id='type-id-35'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='acpi_hid' type-id='type-id-33' visibility='default' filepath='src/linux.h' line='19' column='1'/>
@@ -623,7 +624,7 @@
       <parameter is-variadic='yes'/>
       <return type-id='type-id-90'/>
     </function-decl>
-    <function-decl name='efi_generate_ipv4_device_path' mangled-name='efi_generate_ipv4_device_path' filepath='src/creator.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path@@libefiboot.so.0'>
+    <function-decl name='efi_generate_ipv4_device_path_with_uri' mangled-name='efi_generate_ipv4_device_path_with_uri' filepath='src/creator.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path_with_uri@@LIBEFIBOOT_1.32'>
       <parameter type-id='type-id-111' name='buf' filepath='src/creator.c' line='461' column='1'/>
       <parameter type-id='type-id-90' name='size' filepath='src/creator.c' line='461' column='1'/>
       <parameter type-id='type-id-101' name='ifname' filepath='src/creator.c' line='462' column='1'/>
@@ -635,9 +636,24 @@
       <parameter type-id='type-id-34' name='remote_port' filepath='src/creator.c' line='468' column='1'/>
       <parameter type-id='type-id-34' name='protocol' filepath='src/creator.c' line='469' column='1'/>
       <parameter type-id='type-id-21' name='addr_origin' filepath='src/creator.c' line='470' column='1'/>
+      <parameter type-id='type-id-101' name='uri' filepath='src/creator.c' line='471' column='1'/>
       <return type-id='type-id-90'/>
     </function-decl>
-    <function-decl name='efi_get_libefiboot_version' mangled-name='efi_get_libefiboot_version' filepath='src/creator.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_libefiboot_version@@LIBEFIBOOT_1.31'>
+    <function-decl name='efi_generate_ipv4_device_path' mangled-name='efi_generate_ipv4_device_path' filepath='src/creator.c' line='512' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_generate_ipv4_device_path@@libefiboot.so.0'>
+      <parameter type-id='type-id-111' name='buf' filepath='src/creator.c' line='512' column='1'/>
+      <parameter type-id='type-id-90' name='size' filepath='src/creator.c' line='512' column='1'/>
+      <parameter type-id='type-id-101' name='ifname' filepath='src/creator.c' line='513' column='1'/>
+      <parameter type-id='type-id-101' name='local_addr' filepath='src/creator.c' line='514' column='1'/>
+      <parameter type-id='type-id-101' name='remote_addr' filepath='src/creator.c' line='515' column='1'/>
+      <parameter type-id='type-id-101' name='gateway_addr' filepath='src/creator.c' line='516' column='1'/>
+      <parameter type-id='type-id-101' name='netmask' filepath='src/creator.c' line='517' column='1'/>
+      <parameter type-id='type-id-34' name='local_port' filepath='src/creator.c' line='518' column='1'/>
+      <parameter type-id='type-id-34' name='remote_port' filepath='src/creator.c' line='519' column='1'/>
+      <parameter type-id='type-id-34' name='protocol' filepath='src/creator.c' line='520' column='1'/>
+      <parameter type-id='type-id-21' name='addr_origin' filepath='src/creator.c' line='521' column='1'/>
+      <return type-id='type-id-90'/>
+    </function-decl>
+    <function-decl name='efi_get_libefiboot_version' mangled-name='efi_get_libefiboot_version' filepath='src/creator.c' line='530' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_libefiboot_version@@LIBEFIBOOT_1.31'>
       <return type-id='type-id-33'/>
     </function-decl>
     <function-decl name='is_partitioned' filepath='src/disk.h' line='10' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -652,13 +668,13 @@
       <parameter type-id='type-id-33'/>
       <return type-id='type-id-90'/>
     </function-decl>
-    <function-decl name='efidp_make_edd10' filepath='src/include/efivar/efivar-dp.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_edd10' filepath='src/include/efivar/efivar-dp.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-33'/>
       <return type-id='type-id-90'/>
     </function-decl>
-    <function-decl name='efidp_make_ipv4' filepath='src/include/efivar/efivar-dp.h' line='449' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_ipv4' filepath='src/include/efivar/efivar-dp.h' line='453' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-33'/>
@@ -671,13 +687,19 @@
       <parameter type-id='type-id-18'/>
       <return type-id='type-id-90'/>
     </function-decl>
-    <function-decl name='efidp_make_file' filepath='src/include/efivar/efivar-dp.h' line='758' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_uri' filepath='src/include/efivar/efivar-dp.h' line='654' column='1' visibility='default' binding='global' size-in-bits='64'>
+      <parameter type-id='type-id-111'/>
+      <parameter type-id='type-id-90'/>
+      <parameter type-id='type-id-101'/>
+      <return type-id='type-id-90'/>
+    </function-decl>
+    <function-decl name='efidp_make_file' filepath='src/include/efivar/efivar-dp.h' line='764' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-37'/>
       <return type-id='type-id-90'/>
     </function-decl>
-    <function-decl name='efidp_make_generic' filepath='src/include/efivar/efivar-dp.h' line='1204' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_generic' filepath='src/include/efivar/efivar-dp.h' line='1210' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-21'/>
@@ -685,7 +707,7 @@
       <parameter type-id='type-id-90'/>
       <return type-id='type-id-90'/>
     </function-decl>
-    <function-decl name='efi_error_set' filepath='src/include/efivar/efivar.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_error_set' filepath='src/include/efivar/efivar.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-100'/>
       <parameter type-id='type-id-100'/>
       <parameter type-id='type-id-18'/>
@@ -694,14 +716,14 @@
       <parameter is-variadic='yes'/>
       <return type-id='type-id-18'/>
     </function-decl>
-    <function-decl name='efi_error_clear' filepath='src/include/efivar/efivar.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_error_clear' filepath='src/include/efivar/efivar.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
       <return type-id='type-id-30'/>
     </function-decl>
-    <function-decl name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-18'/>
       <return type-id='type-id-30'/>
     </function-decl>
-    <function-decl name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64'>
       <return type-id='type-id-92'/>
     </function-decl>
     <function-decl name='device_get' filepath='src/linux.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -836,7 +858,7 @@
       <parameter type-id='type-id-18'/>
       <return type-id='type-id-18'/>
     </function-decl>
-    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='837' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-102'/>
       <parameter type-id='type-id-96'/>
       <parameter type-id='type-id-87'/>
@@ -888,7 +910,7 @@
       <parameter type-id='type-id-18'/>
       <return type-id='type-id-18'/>
     </function-decl>
-    <function-decl name='efidp_make_hd' filepath='src/include/efivar/efivar-dp.h' line='722' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_hd' filepath='src/include/efivar/efivar-dp.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-33'/>
@@ -995,14 +1017,14 @@
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-acpi-root.c' comp-dir-path='src' language='LANG_C11'>
-    <function-decl name='efidp_make_acpi_hid' filepath='src/include/efivar/efivar-dp.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_acpi_hid' filepath='src/include/efivar/efivar-dp.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-33'/>
       <parameter type-id='type-id-33'/>
       <return type-id='type-id-90'/>
     </function-decl>
-    <function-decl name='efidp_make_acpi_hid_ex' filepath='src/include/efivar/efivar-dp.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_acpi_hid_ex' filepath='src/include/efivar/efivar-dp.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-33'/>
@@ -1038,7 +1060,7 @@
   </abi-instr>
   <abi-instr address-size='64' path='linux-ata.c' comp-dir-path='src' language='LANG_C11'>
     <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-124'/>
-    <function-decl name='efidp_make_atapi' filepath='src/include/efivar/efivar-dp.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_atapi' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-34'/>
@@ -1066,7 +1088,7 @@
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-emmc.c' comp-dir-path='src' language='LANG_C11'>
-    <function-decl name='efidp_make_emmc' filepath='src/include/efivar/efivar-dp.h' line='682' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_emmc' filepath='src/include/efivar/efivar-dp.h' line='688' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-33'/>
@@ -1078,7 +1100,7 @@
     <var-decl name='i2o_parser' type-id='type-id-56' visibility='default' filepath='src/linux.h' line='357' column='1'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-nvme.c' comp-dir-path='src' language='LANG_C11'>
-    <function-decl name='efidp_make_nvme' filepath='src/include/efivar/efivar-dp.h' line='642' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_nvme' filepath='src/include/efivar/efivar-dp.h' line='646' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-33'/>
@@ -1091,7 +1113,7 @@
     <var-decl name='pci_root_parser' type-id='type-id-56' visibility='default' filepath='src/linux.h' line='348' column='1'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-pci.c' comp-dir-path='src' language='LANG_C11'>
-    <function-decl name='efidp_make_pci' filepath='src/include/efivar/efivar-dp.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_pci' filepath='src/include/efivar/efivar-dp.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-21'/>
@@ -1101,13 +1123,13 @@
     <var-decl name='pci_parser' type-id='type-id-56' visibility='default' filepath='src/linux.h' line='352' column='1'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux-pmem.c' comp-dir-path='src' language='LANG_C11'>
-    <function-decl name='efidp_make_nvdimm' filepath='src/include/efivar/efivar-dp.h' line='706' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_nvdimm' filepath='src/include/efivar/efivar-dp.h' line='712' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-114'/>
       <return type-id='type-id-90'/>
     </function-decl>
-    <function-decl name='efi_str_to_guid' filepath='src/include/efivar/efivar.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_str_to_guid' filepath='src/include/efivar/efivar.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-100'/>
       <parameter type-id='type-id-114'/>
       <return type-id='type-id-18'/>
@@ -1119,7 +1141,7 @@
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-sas.c' comp-dir-path='src' language='LANG_C11'>
-    <function-decl name='efidp_make_sas' filepath='src/include/efivar/efivar-dp.h' line='566' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_sas' filepath='src/include/efivar/efivar-dp.h' line='570' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-36'/>
@@ -1152,7 +1174,7 @@
     <typedef-decl name='int16_t' type-id='type-id-129' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-130'/>
     <typedef-decl name='__int16_t' type-id='type-id-127' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-129'/>
     <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-131'/>
-    <function-decl name='efidp_make_sata' filepath='src/include/efivar/efivar-dp.h' line='415' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_sata' filepath='src/include/efivar/efivar-dp.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-34'/>
@@ -1175,7 +1197,7 @@
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='linux-scsi.c' comp-dir-path='src' language='LANG_C11'>
-    <function-decl name='efidp_make_scsi' filepath='src/include/efivar/efivar-dp.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_scsi' filepath='src/include/efivar/efivar-dp.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-34'/>
@@ -1194,14 +1216,14 @@
     <var-decl name='virtual_root_parser' type-id='type-id-56' visibility='default' filepath='src/linux.h' line='351' column='1'/>
   </abi-instr>
   <abi-instr address-size='64' path='linux.c' comp-dir-path='src' language='LANG_C11'>
-    <typedef-decl name='const_efidp' type-id='type-id-132' filepath='src/include/efivar/efivar-dp.h' line='885' column='1' id='type-id-133'/>
+    <typedef-decl name='const_efidp' type-id='type-id-132' filepath='src/include/efivar/efivar-dp.h' line='891' column='1' id='type-id-133'/>
     <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-134'/>
     <qualified-type-def type-id='type-id-135' const='yes' id='type-id-136'/>
     <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-132'/>
     <qualified-type-def type-id='type-id-21' const='yes' id='type-id-137'/>
     <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
     <qualified-type-def type-id='type-id-138' const='yes' id='type-id-139'/>
-    <function-decl name='efidp_make_mac_addr' filepath='src/include/efivar/efivar-dp.h' line='430' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_make_mac_addr' filepath='src/include/efivar/efivar-dp.h' line='434' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-111'/>
       <parameter type-id='type-id-90'/>
       <parameter type-id='type-id-21'/>
@@ -1209,14 +1231,14 @@
       <parameter type-id='type-id-90'/>
       <return type-id='type-id-90'/>
     </function-decl>
-    <function-decl name='efidp_format_device_path' filepath='src/include/efivar/efivar-dp.h' line='1199' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efidp_format_device_path' filepath='src/include/efivar/efivar-dp.h' line='1205' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-140'/>
       <parameter type-id='type-id-87'/>
       <parameter type-id='type-id-133'/>
       <parameter type-id='type-id-90'/>
       <return type-id='type-id-90'/>
     </function-decl>
-    <function-decl name='efi_error_pop' filepath='src/include/efivar/efivar.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_error_pop' filepath='src/include/efivar/efivar.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
       <return type-id='type-id-30'/>
     </function-decl>
     <function-decl name='find_path_segment' filepath='src/path-helpers.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -1294,940 +1316,940 @@
     <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='infinite' id='type-id-157'>
       <subrange length='infinite' type-id='type-id-3' id='type-id-143'/>
     </array-type-def>
-    <typedef-decl name='efi_load_option' type-id='type-id-158' filepath='src/include/efivar/efiboot-loadopt.h' line='10' column='1' id='type-id-159'/>
-    <class-decl name='efidp_header' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='23' column='1' id='type-id-161'>
+    <typedef-decl name='efi_load_option' type-id='type-id-158' filepath='src/include/efivar/efiboot-loadopt.h' line='14' column='1' id='type-id-159'/>
+    <class-decl name='efidp_header' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' id='type-id-161'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='24' column='1'/>
+        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='28' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='8'>
-        <var-decl name='subtype' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='25' column='1'/>
+        <var-decl name='subtype' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='29' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='length' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='26' column='1'/>
+        <var-decl name='length' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='30' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_header' type-id='type-id-161' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' id='type-id-160'/>
-    <typedef-decl name='efidp_boolean' type-id='type-id-21' filepath='src/include/efivar/efivar-dp.h' line='30' column='1' id='type-id-162'/>
-    <class-decl name='efidp_pci' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-163' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='42' column='1' id='type-id-164'>
+    <typedef-decl name='efidp_header' type-id='type-id-161' filepath='src/include/efivar/efivar-dp.h' line='31' column='1' id='type-id-160'/>
+    <typedef-decl name='efidp_boolean' type-id='type-id-21' filepath='src/include/efivar/efivar-dp.h' line='34' column='1' id='type-id-162'/>
+    <class-decl name='efidp_pci' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-163' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' id='type-id-164'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='43' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='47' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='function' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='44' column='1'/>
+        <var-decl name='function' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='48' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='device' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='45' column='1'/>
+        <var-decl name='device' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='49' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_pci' type-id='type-id-164' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' id='type-id-163'/>
-    <class-decl name='efidp_pccard' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='51' column='1' id='type-id-166'>
+    <typedef-decl name='efidp_pci' type-id='type-id-164' filepath='src/include/efivar/efivar-dp.h' line='50' column='1' id='type-id-163'/>
+    <class-decl name='efidp_pccard' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-166'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='52' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='function' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='53' column='1'/>
+        <var-decl name='function' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_pccard' type-id='type-id-166' filepath='src/include/efivar/efivar-dp.h' line='54' column='1' id='type-id-165'/>
-    <class-decl name='efidp_mmio' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-167' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1' id='type-id-168'>
+    <typedef-decl name='efidp_pccard' type-id='type-id-166' filepath='src/include/efivar/efivar-dp.h' line='58' column='1' id='type-id-165'/>
+    <class-decl name='efidp_mmio' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-167' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='61' column='1' id='type-id-168'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='62' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='memory_type' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='59' column='1'/>
+        <var-decl name='memory_type' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='63' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='starting_address' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='60' column='1'/>
+        <var-decl name='starting_address' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='ending_address' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='61' column='1'/>
+        <var-decl name='ending_address' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_mmio' type-id='type-id-168' filepath='src/include/efivar/efivar-dp.h' line='62' column='1' id='type-id-167'/>
-    <class-decl name='efidp_hw_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-169' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1' id='type-id-170'>
+    <typedef-decl name='efidp_mmio' type-id='type-id-168' filepath='src/include/efivar/efivar-dp.h' line='66' column='1' id='type-id-167'/>
+    <class-decl name='efidp_hw_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-169' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' id='type-id-170'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='66' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='67' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='68' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_hw_vendor' type-id='type-id-170' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' id='type-id-169'/>
-    <class-decl name='efidp_controller' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='86' column='1' id='type-id-172'>
+    <typedef-decl name='efidp_hw_vendor' type-id='type-id-170' filepath='src/include/efivar/efivar-dp.h' line='73' column='1' id='type-id-169'/>
+    <class-decl name='efidp_controller' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='90' column='1' id='type-id-172'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='87' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='91' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='controller' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='88' column='1'/>
+        <var-decl name='controller' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_controller' type-id='type-id-172' filepath='src/include/efivar/efivar-dp.h' line='89' column='1' id='type-id-171'/>
-    <class-decl name='efidp_bmc' size-in-bits='104' is-struct='yes' naming-typedef-id='type-id-173' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1' id='type-id-174'>
+    <typedef-decl name='efidp_controller' type-id='type-id-172' filepath='src/include/efivar/efivar-dp.h' line='93' column='1' id='type-id-171'/>
+    <class-decl name='efidp_bmc' size-in-bits='104' is-struct='yes' naming-typedef-id='type-id-173' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' id='type-id-174'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='93' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='97' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='interface_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='94' column='1'/>
+        <var-decl name='interface_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='98' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='base_addr' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='95' column='1'/>
+        <var-decl name='base_addr' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_bmc' type-id='type-id-174' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' id='type-id-173'/>
-    <class-decl name='efidp_acpi_hid' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-175' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='106' column='1' id='type-id-176'>
+    <typedef-decl name='efidp_bmc' type-id='type-id-174' filepath='src/include/efivar/efivar-dp.h' line='100' column='1' id='type-id-173'/>
+    <class-decl name='efidp_acpi_hid' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-175' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' id='type-id-176'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='107' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='111' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hid' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='108' column='1'/>
+        <var-decl name='hid' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='112' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='uid' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='109' column='1'/>
+        <var-decl name='uid' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='113' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_acpi_hid' type-id='type-id-176' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' id='type-id-175'/>
-    <class-decl name='efidp_acpi_hid_ex' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-177' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='115' column='1' id='type-id-178'>
+    <typedef-decl name='efidp_acpi_hid' type-id='type-id-176' filepath='src/include/efivar/efivar-dp.h' line='114' column='1' id='type-id-175'/>
+    <class-decl name='efidp_acpi_hid_ex' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-177' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-178'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='116' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hid' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='117' column='1'/>
+        <var-decl name='hid' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='uid' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='118' column='1'/>
+        <var-decl name='uid' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='cid' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1'/>
+        <var-decl name='cid' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='123' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='hidstr' type-id='type-id-142' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
+        <var-decl name='hidstr' type-id='type-id-142' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='125' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-178' filepath='src/include/efivar/efivar-dp.h' line='122' column='1' id='type-id-177'/>
-    <class-decl name='efidp_acpi_adr' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='156' column='1' id='type-id-180'>
+    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-178' filepath='src/include/efivar/efivar-dp.h' line='126' column='1' id='type-id-177'/>
+    <class-decl name='efidp_acpi_adr' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='160' column='1' id='type-id-180'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='157' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='161' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='adr' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='158' column='1'/>
+        <var-decl name='adr' type-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='162' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_acpi_adr' type-id='type-id-180' filepath='src/include/efivar/efivar-dp.h' line='159' column='1' id='type-id-179'/>
-    <class-decl name='efidp_atapi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-181' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='317' column='1' id='type-id-182'>
+    <typedef-decl name='efidp_acpi_adr' type-id='type-id-180' filepath='src/include/efivar/efivar-dp.h' line='163' column='1' id='type-id-179'/>
+    <class-decl name='efidp_atapi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-181' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='321' column='1' id='type-id-182'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='318' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='322' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='primary' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='319' column='1'/>
+        <var-decl name='primary' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='323' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='slave' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='320' column='1'/>
+        <var-decl name='slave' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='324' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='lun' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='321' column='1'/>
+        <var-decl name='lun' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='325' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_atapi' type-id='type-id-182' filepath='src/include/efivar/efivar-dp.h' line='322' column='1' id='type-id-181'/>
-    <class-decl name='efidp_scsi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-183' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' id='type-id-184'>
+    <typedef-decl name='efidp_atapi' type-id='type-id-182' filepath='src/include/efivar/efivar-dp.h' line='326' column='1' id='type-id-181'/>
+    <class-decl name='efidp_scsi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-183' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' id='type-id-184'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='328' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='target' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='329' column='1'/>
+        <var-decl name='target' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='lun' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='330' column='1'/>
+        <var-decl name='lun' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_scsi' type-id='type-id-184' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' id='type-id-183'/>
-    <class-decl name='efidp_fc' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-185' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='336' column='1' id='type-id-186'>
+    <typedef-decl name='efidp_scsi' type-id='type-id-184' filepath='src/include/efivar/efivar-dp.h' line='335' column='1' id='type-id-183'/>
+    <class-decl name='efidp_fc' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-185' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' id='type-id-186'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='337' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='338' column='1'/>
+        <var-decl name='reserved' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='342' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='wwn' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='339' column='1'/>
+        <var-decl name='wwn' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='343' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='lun' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1'/>
+        <var-decl name='lun' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_fc' type-id='type-id-186' filepath='src/include/efivar/efivar-dp.h' line='341' column='1' id='type-id-185'/>
-    <class-decl name='efidp_fcex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-187' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1' id='type-id-188'>
+    <typedef-decl name='efidp_fc' type-id='type-id-186' filepath='src/include/efivar/efivar-dp.h' line='345' column='1' id='type-id-185'/>
+    <class-decl name='efidp_fcex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-187' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1' id='type-id-188'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='345' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='346' column='1'/>
+        <var-decl name='reserved' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='wwn' type-id='type-id-24' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='347' column='1'/>
+        <var-decl name='wwn' type-id='type-id-24' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='351' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='lun' type-id='type-id-24' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1'/>
+        <var-decl name='lun' type-id='type-id-24' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_fcex' type-id='type-id-188' filepath='src/include/efivar/efivar-dp.h' line='349' column='1' id='type-id-187'/>
-    <class-decl name='efidp_1394' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-189' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1' id='type-id-190'>
+    <typedef-decl name='efidp_fcex' type-id='type-id-188' filepath='src/include/efivar/efivar-dp.h' line='353' column='1' id='type-id-187'/>
+    <class-decl name='efidp_1394' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-189' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' id='type-id-190'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='353' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='354' column='1'/>
+        <var-decl name='reserved' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='guid' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='355' column='1'/>
+        <var-decl name='guid' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_1394' type-id='type-id-190' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' id='type-id-189'/>
-    <class-decl name='efidp_usb' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1' id='type-id-192'>
+    <typedef-decl name='efidp_1394' type-id='type-id-190' filepath='src/include/efivar/efivar-dp.h' line='360' column='1' id='type-id-189'/>
+    <class-decl name='efidp_usb' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' id='type-id-192'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='360' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='parent_port' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='361' column='1'/>
+        <var-decl name='parent_port' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='interface' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='362' column='1'/>
+        <var-decl name='interface' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_usb' type-id='type-id-192' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' id='type-id-191'/>
-    <class-decl name='efidp_usb_class' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-193' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1' id='type-id-194'>
+    <typedef-decl name='efidp_usb' type-id='type-id-192' filepath='src/include/efivar/efivar-dp.h' line='367' column='1' id='type-id-191'/>
+    <class-decl name='efidp_usb_class' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-193' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1' id='type-id-194'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='367' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='368' column='1'/>
+        <var-decl name='vendor_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='product_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='369' column='1'/>
+        <var-decl name='product_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='373' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='device_class' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1'/>
+        <var-decl name='device_class' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='374' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='72'>
-        <var-decl name='device_subclass' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
+        <var-decl name='device_subclass' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='375' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='device_protocol' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
+        <var-decl name='device_protocol' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_usb_class' type-id='type-id-194' filepath='src/include/efivar/efivar-dp.h' line='373' column='1' id='type-id-193'/>
-    <class-decl name='efidp_usb_wwid' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-195' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='393' column='1' id='type-id-196'>
+    <typedef-decl name='efidp_usb_class' type-id='type-id-194' filepath='src/include/efivar/efivar-dp.h' line='377' column='1' id='type-id-193'/>
+    <class-decl name='efidp_usb_wwid' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-195' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='397' column='1' id='type-id-196'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='394' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='interface' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='395' column='1'/>
+        <var-decl name='interface' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='399' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='vendor_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='396' column='1'/>
+        <var-decl name='vendor_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='400' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='product_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='397' column='1'/>
+        <var-decl name='product_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='401' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='serial_number' type-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
+        <var-decl name='serial_number' type-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_usb_wwid' type-id='type-id-196' filepath='src/include/efivar/efivar-dp.h' line='399' column='1' id='type-id-195'/>
-    <class-decl name='efidp_lun' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-197' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1' id='type-id-198'>
+    <typedef-decl name='efidp_usb_wwid' type-id='type-id-196' filepath='src/include/efivar/efivar-dp.h' line='403' column='1' id='type-id-195'/>
+    <class-decl name='efidp_lun' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-197' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' id='type-id-198'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='403' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='404' column='1'/>
+        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_lun' type-id='type-id-198' filepath='src/include/efivar/efivar-dp.h' line='405' column='1' id='type-id-197'/>
-    <class-decl name='efidp_sata' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1' id='type-id-200'>
+    <typedef-decl name='efidp_lun' type-id='type-id-198' filepath='src/include/efivar/efivar-dp.h' line='409' column='1' id='type-id-197'/>
+    <class-decl name='efidp_sata' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-200'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='409' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hba_port' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='410' column='1'/>
+        <var-decl name='hba_port' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='414' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='port_multiplier_port' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='411' column='1'/>
+        <var-decl name='port_multiplier_port' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='415' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='lun' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1'/>
+        <var-decl name='lun' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='416' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sata' type-id='type-id-200' filepath='src/include/efivar/efivar-dp.h' line='413' column='1' id='type-id-199'/>
-    <class-decl name='efidp_i2o' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-201' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='419' column='1' id='type-id-202'>
+    <typedef-decl name='efidp_sata' type-id='type-id-200' filepath='src/include/efivar/efivar-dp.h' line='417' column='1' id='type-id-199'/>
+    <class-decl name='efidp_i2o' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-201' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' id='type-id-202'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='420' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='target' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='421' column='1'/>
+        <var-decl name='target' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_i2o' type-id='type-id-202' filepath='src/include/efivar/efivar-dp.h' line='422' column='1' id='type-id-201'/>
-    <class-decl name='efidp_mac_addr' size-in-bits='296' is-struct='yes' naming-typedef-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1' id='type-id-204'>
+    <typedef-decl name='efidp_i2o' type-id='type-id-202' filepath='src/include/efivar/efivar-dp.h' line='426' column='1' id='type-id-201'/>
+    <class-decl name='efidp_mac_addr' size-in-bits='296' is-struct='yes' naming-typedef-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-204'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='426' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='mac_addr' type-id='type-id-154' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='427' column='1'/>
+        <var-decl name='mac_addr' type-id='type-id-154' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='if_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='428' column='1'/>
+        <var-decl name='if_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='432' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_mac_addr' type-id='type-id-204' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-203'/>
-    <class-decl name='efidp_ipv4_addr' size-in-bits='216' is-struct='yes' naming-typedef-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='437' column='1' id='type-id-206'>
+    <typedef-decl name='efidp_mac_addr' type-id='type-id-204' filepath='src/include/efivar/efivar-dp.h' line='433' column='1' id='type-id-203'/>
+    <class-decl name='efidp_ipv4_addr' size-in-bits='216' is-struct='yes' naming-typedef-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1' id='type-id-206'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='438' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='local_ipv4_addr' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='439' column='1'/>
+        <var-decl name='local_ipv4_addr' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='remote_ipv4_addr' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='440' column='1'/>
+        <var-decl name='remote_ipv4_addr' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='local_port' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1'/>
+        <var-decl name='local_port' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='112'>
-        <var-decl name='remote_port' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
+        <var-decl name='remote_port' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='446' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='protocol' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
+        <var-decl name='protocol' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='static_ip_addr' type-id='type-id-162' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
+        <var-decl name='static_ip_addr' type-id='type-id-162' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='152'>
-        <var-decl name='gateway' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
+        <var-decl name='gateway' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='184'>
-        <var-decl name='netmask' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='446' column='1'/>
+        <var-decl name='netmask' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-206' filepath='src/include/efivar/efivar-dp.h' line='447' column='1' id='type-id-205'/>
-    <class-decl name='efidp_ipv6_addr' size-in-bits='360' is-struct='yes' naming-typedef-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='459' column='1' id='type-id-208'>
+    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-206' filepath='src/include/efivar/efivar-dp.h' line='451' column='1' id='type-id-205'/>
+    <class-decl name='efidp_ipv6_addr' size-in-bits='360' is-struct='yes' naming-typedef-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='463' column='1' id='type-id-208'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='460' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='local_ipv6_addr' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='461' column='1'/>
+        <var-decl name='local_ipv6_addr' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='remote_ipv6_addr' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='462' column='1'/>
+        <var-decl name='remote_ipv6_addr' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='local_port' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='463' column='1'/>
+        <var-decl name='local_port' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='304'>
-        <var-decl name='remote_port' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
+        <var-decl name='remote_port' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='468' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='protocol' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
+        <var-decl name='protocol' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='469' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='336'>
-        <var-decl name='ip_addr_origin' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
+        <var-decl name='ip_addr_origin' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='470' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='344'>
-        <var-decl name='prefix_length' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
+        <var-decl name='prefix_length' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='352'>
-        <var-decl name='gateway_ipv6_addr' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='468' column='1'/>
+        <var-decl name='gateway_ipv6_addr' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-208' filepath='src/include/efivar/efivar-dp.h' line='469' column='1' id='type-id-207'/>
-    <class-decl name='efidp_vlan' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='476' column='1' id='type-id-210'>
+    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-208' filepath='src/include/efivar/efivar-dp.h' line='473' column='1' id='type-id-207'/>
+    <class-decl name='efidp_vlan' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='480' column='1' id='type-id-210'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='477' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='481' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vlan_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='478' column='1'/>
+        <var-decl name='vlan_id' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_vlan' type-id='type-id-210' filepath='src/include/efivar/efivar-dp.h' line='479' column='1' id='type-id-209'/>
-    <class-decl name='efidp_infiniband' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-211' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1' id='type-id-212'>
+    <typedef-decl name='efidp_vlan' type-id='type-id-210' filepath='src/include/efivar/efivar-dp.h' line='483' column='1' id='type-id-209'/>
+    <class-decl name='efidp_infiniband' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-211' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='486' column='1' id='type-id-212'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='483' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='resource_flags' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='484' column='1'/>
+        <var-decl name='resource_flags' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='port_gid' type-id='type-id-150' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='485' column='1'/>
+        <var-decl name='port_gid' type-id='type-id-150' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='489' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
         <var-decl name='' type-id='type-id-213' visibility='default'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='target_port_id' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
+        <var-decl name='target_port_id' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='494' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='device_id' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='491' column='1'/>
+        <var-decl name='device_id' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
       </data-member>
     </class-decl>
-    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='486' column='1' id='type-id-213'>
+    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1' id='type-id-213'>
       <data-member access='public'>
-        <var-decl name='ioc_guid' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1'/>
+        <var-decl name='ioc_guid' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='491' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='service_id' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
+        <var-decl name='service_id' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='492' column='1'/>
       </data-member>
     </union-decl>
-    <typedef-decl name='efidp_infiniband' type-id='type-id-212' filepath='src/include/efivar/efivar-dp.h' line='492' column='1' id='type-id-211'/>
-    <class-decl name='efidp_uart' size-in-bits='152' is-struct='yes' naming-typedef-id='type-id-214' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='501' column='1' id='type-id-215'>
+    <typedef-decl name='efidp_infiniband' type-id='type-id-212' filepath='src/include/efivar/efivar-dp.h' line='496' column='1' id='type-id-211'/>
+    <class-decl name='efidp_uart' size-in-bits='152' is-struct='yes' naming-typedef-id='type-id-214' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='505' column='1' id='type-id-215'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='502' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='506' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='503' column='1'/>
+        <var-decl name='reserved' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='baud_rate' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='504' column='1'/>
+        <var-decl name='baud_rate' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='508' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='data_bits' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='505' column='1'/>
+        <var-decl name='data_bits' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='509' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='136'>
-        <var-decl name='parity' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='506' column='1'/>
+        <var-decl name='parity' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='510' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='stop_bits' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
+        <var-decl name='stop_bits' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='511' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_uart' type-id='type-id-215' filepath='src/include/efivar/efivar-dp.h' line='508' column='1' id='type-id-214'/>
-    <class-decl name='efidp_msg_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-216' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='532' column='1' id='type-id-217'>
+    <typedef-decl name='efidp_uart' type-id='type-id-215' filepath='src/include/efivar/efivar-dp.h' line='512' column='1' id='type-id-214'/>
+    <class-decl name='efidp_msg_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-216' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='536' column='1' id='type-id-217'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='533' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='537' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='534' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='538' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='535' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='539' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_msg_vendor' type-id='type-id-217' filepath='src/include/efivar/efivar-dp.h' line='536' column='1' id='type-id-216'/>
-    <class-decl name='efidp_uart_flow_control' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-218' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='545' column='1' id='type-id-219'>
+    <typedef-decl name='efidp_msg_vendor' type-id='type-id-217' filepath='src/include/efivar/efivar-dp.h' line='540' column='1' id='type-id-216'/>
+    <class-decl name='efidp_uart_flow_control' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-218' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='549' column='1' id='type-id-219'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='546' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='550' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='547' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='551' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='flow_control_map' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='548' column='1'/>
+        <var-decl name='flow_control_map' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='552' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-219' filepath='src/include/efivar/efivar-dp.h' line='549' column='1' id='type-id-218'/>
-    <class-decl name='efidp_sas' size-in-bits='352' is-struct='yes' naming-typedef-id='type-id-220' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='556' column='1' id='type-id-221'>
+    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-219' filepath='src/include/efivar/efivar-dp.h' line='553' column='1' id='type-id-218'/>
+    <class-decl name='efidp_sas' size-in-bits='352' is-struct='yes' naming-typedef-id='type-id-220' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='560' column='1' id='type-id-221'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='557' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='558' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='reserved' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='559' column='1'/>
+        <var-decl name='reserved' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='sas_address' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='560' column='1'/>
+        <var-decl name='sas_address' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='564' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='lun' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1'/>
+        <var-decl name='lun' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='565' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='device_topology_info' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
+        <var-decl name='device_topology_info' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='566' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='328'>
-        <var-decl name='drive_bay_id' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
+        <var-decl name='drive_bay_id' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='567' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='336'>
-        <var-decl name='rtp' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='564' column='1'/>
+        <var-decl name='rtp' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='568' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sas' type-id='type-id-221' filepath='src/include/efivar/efivar-dp.h' line='565' column='1' id='type-id-220'/>
-    <class-decl name='efidp_sas_ex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='589' column='1' id='type-id-223'>
+    <typedef-decl name='efidp_sas' type-id='type-id-221' filepath='src/include/efivar/efivar-dp.h' line='569' column='1' id='type-id-220'/>
+    <class-decl name='efidp_sas_ex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='593' column='1' id='type-id-223'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='590' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='594' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='sas_address' type-id='type-id-24' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='591' column='1'/>
+        <var-decl name='sas_address' type-id='type-id-24' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='lun' type-id='type-id-24' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='592' column='1'/>
+        <var-decl name='lun' type-id='type-id-24' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='596' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='device_topology_info' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='593' column='1'/>
+        <var-decl name='device_topology_info' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='597' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='168'>
-        <var-decl name='drive_bay_id' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='594' column='1'/>
+        <var-decl name='drive_bay_id' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='598' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='176'>
-        <var-decl name='rtp' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
+        <var-decl name='rtp' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='599' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sas_ex' type-id='type-id-223' filepath='src/include/efivar/efivar-dp.h' line='596' column='1' id='type-id-222'/>
-    <class-decl name='efidp_iscsi' size-in-bits='144' is-struct='yes' naming-typedef-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='602' column='1' id='type-id-225'>
+    <typedef-decl name='efidp_sas_ex' type-id='type-id-223' filepath='src/include/efivar/efivar-dp.h' line='600' column='1' id='type-id-222'/>
+    <class-decl name='efidp_iscsi' size-in-bits='144' is-struct='yes' naming-typedef-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='606' column='1' id='type-id-225'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='603' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='protocol' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='604' column='1'/>
+        <var-decl name='protocol' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='options' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='605' column='1'/>
+        <var-decl name='options' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='609' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='lun' type-id='type-id-24' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='606' column='1'/>
+        <var-decl name='lun' type-id='type-id-24' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='610' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='tpgt' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1'/>
+        <var-decl name='tpgt' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='611' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='target_name' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
+        <var-decl name='target_name' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_iscsi' type-id='type-id-225' filepath='src/include/efivar/efivar-dp.h' line='609' column='1' id='type-id-224'/>
-    <class-decl name='efidp_nvme' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-226' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='637' column='1' id='type-id-227'>
+    <typedef-decl name='efidp_iscsi' type-id='type-id-225' filepath='src/include/efivar/efivar-dp.h' line='613' column='1' id='type-id-224'/>
+    <class-decl name='efidp_nvme' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-226' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='641' column='1' id='type-id-227'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='638' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='642' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='namespace_id' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='639' column='1'/>
+        <var-decl name='namespace_id' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='643' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='ieee_eui_64' type-id='type-id-24' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='640' column='1'/>
+        <var-decl name='ieee_eui_64' type-id='type-id-24' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='644' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_nvme' type-id='type-id-227' filepath='src/include/efivar/efivar-dp.h' line='641' column='1' id='type-id-226'/>
-    <class-decl name='efidp_uri' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-228' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='646' column='1' id='type-id-229'>
+    <typedef-decl name='efidp_nvme' type-id='type-id-227' filepath='src/include/efivar/efivar-dp.h' line='645' column='1' id='type-id-226'/>
+    <class-decl name='efidp_uri' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-228' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='650' column='1' id='type-id-229'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='647' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='651' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='uri' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='648' column='1'/>
+        <var-decl name='uri' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_uri' type-id='type-id-229' filepath='src/include/efivar/efivar-dp.h' line='649' column='1' id='type-id-228'/>
-    <class-decl name='efidp_ufs' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-230' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1' id='type-id-231'>
+    <typedef-decl name='efidp_uri' type-id='type-id-229' filepath='src/include/efivar/efivar-dp.h' line='653' column='1' id='type-id-228'/>
+    <class-decl name='efidp_ufs' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-230' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1' id='type-id-231'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='target_id' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='654' column='1'/>
+        <var-decl name='target_id' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='655' column='1'/>
+        <var-decl name='lun' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='661' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_ufs' type-id='type-id-231' filepath='src/include/efivar/efivar-dp.h' line='656' column='1' id='type-id-230'/>
-    <class-decl name='efidp_sd' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-232' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1' id='type-id-233'>
+    <typedef-decl name='efidp_ufs' type-id='type-id-231' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-230'/>
+    <class-decl name='efidp_sd' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-232' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1' id='type-id-233'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='slot_number' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='661' column='1'/>
+        <var-decl name='slot_number' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='667' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sd' type-id='type-id-233' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-232'/>
-    <class-decl name='efidp_bt' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-234' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1' id='type-id-235'>
+    <typedef-decl name='efidp_sd' type-id='type-id-233' filepath='src/include/efivar/efivar-dp.h' line='668' column='1' id='type-id-232'/>
+    <class-decl name='efidp_bt' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-234' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1' id='type-id-235'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='addr' type-id='type-id-22' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='667' column='1'/>
+        <var-decl name='addr' type-id='type-id-22' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='673' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_bt' type-id='type-id-235' filepath='src/include/efivar/efivar-dp.h' line='668' column='1' id='type-id-234'/>
-    <class-decl name='efidp_wifi' size-in-bits='288' is-struct='yes' naming-typedef-id='type-id-236' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1' id='type-id-237'>
+    <typedef-decl name='efidp_bt' type-id='type-id-235' filepath='src/include/efivar/efivar-dp.h' line='674' column='1' id='type-id-234'/>
+    <class-decl name='efidp_wifi' size-in-bits='288' is-struct='yes' naming-typedef-id='type-id-236' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1' id='type-id-237'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='ssid' type-id='type-id-154' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='673' column='1'/>
+        <var-decl name='ssid' type-id='type-id-154' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='679' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_wifi' type-id='type-id-237' filepath='src/include/efivar/efivar-dp.h' line='674' column='1' id='type-id-236'/>
-    <class-decl name='efidp_emmc' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-238' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1' id='type-id-239'>
+    <typedef-decl name='efidp_wifi' type-id='type-id-237' filepath='src/include/efivar/efivar-dp.h' line='680' column='1' id='type-id-236'/>
+    <class-decl name='efidp_emmc' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-238' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1' id='type-id-239'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='684' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='slot' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='679' column='1'/>
+        <var-decl name='slot' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='685' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_emmc' type-id='type-id-239' filepath='src/include/efivar/efivar-dp.h' line='680' column='1' id='type-id-238'/>
-    <class-decl name='efidp_btle' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-240' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='685' column='1' id='type-id-241'>
+    <typedef-decl name='efidp_emmc' type-id='type-id-239' filepath='src/include/efivar/efivar-dp.h' line='686' column='1' id='type-id-238'/>
+    <class-decl name='efidp_btle' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-240' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1' id='type-id-241'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='686' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='692' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='addr' type-id='type-id-22' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='687' column='1'/>
+        <var-decl name='addr' type-id='type-id-22' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='addr_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='688' column='1'/>
+        <var-decl name='addr_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='694' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_btle' type-id='type-id-241' filepath='src/include/efivar/efivar-dp.h' line='689' column='1' id='type-id-240'/>
-    <class-decl name='efidp_dns' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-242' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='695' column='1' id='type-id-243'>
+    <typedef-decl name='efidp_btle' type-id='type-id-241' filepath='src/include/efivar/efivar-dp.h' line='695' column='1' id='type-id-240'/>
+    <class-decl name='efidp_dns' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-242' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1' id='type-id-243'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='696' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='702' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='is_ipv6' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='697' column='1'/>
+        <var-decl name='is_ipv6' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='addrs' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='698' column='1'/>
+        <var-decl name='addrs' type-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='704' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_dns' type-id='type-id-243' filepath='src/include/efivar/efivar-dp.h' line='699' column='1' id='type-id-242'/>
-    <class-decl name='efidp_nvdimm' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-244' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='702' column='1' id='type-id-245'>
+    <typedef-decl name='efidp_dns' type-id='type-id-243' filepath='src/include/efivar/efivar-dp.h' line='705' column='1' id='type-id-242'/>
+    <class-decl name='efidp_nvdimm' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-244' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='708' column='1' id='type-id-245'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='703' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='709' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='uuid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='704' column='1'/>
+        <var-decl name='uuid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='710' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_nvdimm' type-id='type-id-245' filepath='src/include/efivar/efivar-dp.h' line='705' column='1' id='type-id-244'/>
-    <class-decl name='efidp_hd' size-in-bits='336' is-struct='yes' naming-typedef-id='type-id-246' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='710' column='1' id='type-id-247'>
+    <typedef-decl name='efidp_nvdimm' type-id='type-id-245' filepath='src/include/efivar/efivar-dp.h' line='711' column='1' id='type-id-244'/>
+    <class-decl name='efidp_hd' size-in-bits='336' is-struct='yes' naming-typedef-id='type-id-246' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1' id='type-id-247'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='711' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='partition_number' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='712' column='1'/>
+        <var-decl name='partition_number' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='718' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='start' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='713' column='1'/>
+        <var-decl name='start' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='719' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='size' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='714' column='1'/>
+        <var-decl name='size' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='720' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='signature' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='715' column='1'/>
+        <var-decl name='signature' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='721' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='format' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='716' column='1'/>
+        <var-decl name='format' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='722' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='328'>
-        <var-decl name='signature_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='717' column='1'/>
+        <var-decl name='signature_type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='723' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_hd' type-id='type-id-247' filepath='src/include/efivar/efivar-dp.h' line='721' column='1' id='type-id-246'/>
-    <class-decl name='efidp_cdrom' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-248' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='735' column='1' id='type-id-249'>
+    <typedef-decl name='efidp_hd' type-id='type-id-247' filepath='src/include/efivar/efivar-dp.h' line='727' column='1' id='type-id-246'/>
+    <class-decl name='efidp_cdrom' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-248' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='741' column='1' id='type-id-249'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='736' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='742' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='boot_catalog_entry' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='737' column='1'/>
+        <var-decl name='boot_catalog_entry' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='partition_rba' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='738' column='1'/>
+        <var-decl name='partition_rba' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='sectors' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='739' column='1'/>
+        <var-decl name='sectors' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='745' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_cdrom' type-id='type-id-249' filepath='src/include/efivar/efivar-dp.h' line='740' column='1' id='type-id-248'/>
-    <class-decl name='efidp_media_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-250' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='743' column='1' id='type-id-251'>
+    <typedef-decl name='efidp_cdrom' type-id='type-id-249' filepath='src/include/efivar/efivar-dp.h' line='746' column='1' id='type-id-248'/>
+    <class-decl name='efidp_media_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-250' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='749' column='1' id='type-id-251'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='744' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='750' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='745' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='751' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='746' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='752' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_media_vendor' type-id='type-id-251' filepath='src/include/efivar/efivar-dp.h' line='747' column='1' id='type-id-250'/>
-    <class-decl name='efidp_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-252' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='754' column='1' id='type-id-253'>
+    <typedef-decl name='efidp_media_vendor' type-id='type-id-251' filepath='src/include/efivar/efivar-dp.h' line='753' column='1' id='type-id-250'/>
+    <class-decl name='efidp_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-252' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='760' column='1' id='type-id-253'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='755' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='761' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='name' type-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='756' column='1'/>
+        <var-decl name='name' type-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='762' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_file' type-id='type-id-253' filepath='src/include/efivar/efivar-dp.h' line='757' column='1' id='type-id-252'/>
-    <class-decl name='efidp_protocol' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-254' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='761' column='1' id='type-id-255'>
+    <typedef-decl name='efidp_file' type-id='type-id-253' filepath='src/include/efivar/efivar-dp.h' line='763' column='1' id='type-id-252'/>
+    <class-decl name='efidp_protocol' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-254' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1' id='type-id-255'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='762' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='protocol_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='763' column='1'/>
+        <var-decl name='protocol_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='769' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_protocol' type-id='type-id-255' filepath='src/include/efivar/efivar-dp.h' line='764' column='1' id='type-id-254'/>
-    <class-decl name='efidp_firmware_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-256' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='767' column='1' id='type-id-257'>
+    <typedef-decl name='efidp_protocol' type-id='type-id-255' filepath='src/include/efivar/efivar-dp.h' line='770' column='1' id='type-id-254'/>
+    <class-decl name='efidp_firmware_file' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-256' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='773' column='1' id='type-id-257'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='768' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pi_info' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='769' column='1'/>
+        <var-decl name='pi_info' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='775' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_firmware_file' type-id='type-id-257' filepath='src/include/efivar/efivar-dp.h' line='770' column='1' id='type-id-256'/>
-    <class-decl name='efidp_firmware_volume' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-258' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='773' column='1' id='type-id-259'>
+    <typedef-decl name='efidp_firmware_file' type-id='type-id-257' filepath='src/include/efivar/efivar-dp.h' line='776' column='1' id='type-id-256'/>
+    <class-decl name='efidp_firmware_volume' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-258' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='779' column='1' id='type-id-259'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='774' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pi_info' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='775' column='1'/>
+        <var-decl name='pi_info' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='781' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_firmware_volume' type-id='type-id-259' filepath='src/include/efivar/efivar-dp.h' line='776' column='1' id='type-id-258'/>
-    <class-decl name='efidp_relative_offset' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-260' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='779' column='1' id='type-id-261'>
+    <typedef-decl name='efidp_firmware_volume' type-id='type-id-259' filepath='src/include/efivar/efivar-dp.h' line='782' column='1' id='type-id-258'/>
+    <class-decl name='efidp_relative_offset' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-260' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='785' column='1' id='type-id-261'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='780' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='786' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='781' column='1'/>
+        <var-decl name='reserved' type-id='type-id-33' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='first_byte' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='782' column='1'/>
+        <var-decl name='first_byte' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='last_byte' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='783' column='1'/>
+        <var-decl name='last_byte' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='789' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_relative_offset' type-id='type-id-261' filepath='src/include/efivar/efivar-dp.h' line='784' column='1' id='type-id-260'/>
-    <class-decl name='efidp_ramdisk' size-in-bits='304' is-struct='yes' naming-typedef-id='type-id-262' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='787' column='1' id='type-id-263'>
+    <typedef-decl name='efidp_relative_offset' type-id='type-id-261' filepath='src/include/efivar/efivar-dp.h' line='790' column='1' id='type-id-260'/>
+    <class-decl name='efidp_ramdisk' size-in-bits='304' is-struct='yes' naming-typedef-id='type-id-262' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='793' column='1' id='type-id-263'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='788' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='794' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='start_addr' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='789' column='1'/>
+        <var-decl name='start_addr' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='795' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='end_addr' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='790' column='1'/>
+        <var-decl name='end_addr' type-id='type-id-36' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='796' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='disk_type_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='791' column='1'/>
+        <var-decl name='disk_type_guid' type-id='type-id-31' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='797' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='instance_number' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='792' column='1'/>
+        <var-decl name='instance_number' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='798' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_ramdisk' type-id='type-id-263' filepath='src/include/efivar/efivar-dp.h' line='793' column='1' id='type-id-262'/>
-    <class-decl name='efidp_bios_boot' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-264' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='806' column='1' id='type-id-265'>
+    <typedef-decl name='efidp_ramdisk' type-id='type-id-263' filepath='src/include/efivar/efivar-dp.h' line='799' column='1' id='type-id-262'/>
+    <class-decl name='efidp_bios_boot' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-264' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='812' column='1' id='type-id-265'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='807' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='813' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='device_type' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='808' column='1'/>
+        <var-decl name='device_type' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='814' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='status' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='809' column='1'/>
+        <var-decl name='status' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='815' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='description' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='810' column='1'/>
+        <var-decl name='description' type-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='816' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_bios_boot' type-id='type-id-265' filepath='src/include/efivar/efivar-dp.h' line='811' column='1' id='type-id-264'/>
-    <union-decl name='efidp_data' size-in-bits='384' naming-typedef-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='825' column='1' id='type-id-266'>
+    <typedef-decl name='efidp_bios_boot' type-id='type-id-265' filepath='src/include/efivar/efivar-dp.h' line='817' column='1' id='type-id-264'/>
+    <union-decl name='efidp_data' size-in-bits='384' naming-typedef-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='831' column='1' id='type-id-266'>
       <data-member access='public'>
         <var-decl name='' type-id='type-id-267' visibility='default'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='831' column='1'/>
+        <var-decl name='header' type-id='type-id-160' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='pci' type-id='type-id-163' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='832' column='1'/>
+        <var-decl name='pci' type-id='type-id-163' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='pccard' type-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1'/>
+        <var-decl name='pccard' type-id='type-id-165' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='mmio' type-id='type-id-167' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1'/>
+        <var-decl name='mmio' type-id='type-id-167' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='hw_vendor' type-id='type-id-169' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='835' column='1'/>
+        <var-decl name='hw_vendor' type-id='type-id-169' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='controller' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='836' column='1'/>
+        <var-decl name='controller' type-id='type-id-171' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='bmc' type-id='type-id-173' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='837' column='1'/>
+        <var-decl name='bmc' type-id='type-id-173' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='acpi_hid' type-id='type-id-175' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='838' column='1'/>
+        <var-decl name='acpi_hid' type-id='type-id-175' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='acpi_hid_ex' type-id='type-id-177' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='839' column='1'/>
+        <var-decl name='acpi_hid_ex' type-id='type-id-177' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='acpi_adr' type-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='840' column='1'/>
+        <var-decl name='acpi_adr' type-id='type-id-179' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='atapi' type-id='type-id-181' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='841' column='1'/>
+        <var-decl name='atapi' type-id='type-id-181' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='scsi' type-id='type-id-183' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='842' column='1'/>
+        <var-decl name='scsi' type-id='type-id-183' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='fc' type-id='type-id-185' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='843' column='1'/>
+        <var-decl name='fc' type-id='type-id-185' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='fcex' type-id='type-id-187' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='844' column='1'/>
+        <var-decl name='fcex' type-id='type-id-187' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='firewire' type-id='type-id-189' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='845' column='1'/>
+        <var-decl name='firewire' type-id='type-id-189' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='usb' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='846' column='1'/>
+        <var-decl name='usb' type-id='type-id-191' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='usb_class' type-id='type-id-193' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='847' column='1'/>
+        <var-decl name='usb_class' type-id='type-id-193' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='usb_wwid' type-id='type-id-195' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='848' column='1'/>
+        <var-decl name='usb_wwid' type-id='type-id-195' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='lun' type-id='type-id-197' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='849' column='1'/>
+        <var-decl name='lun' type-id='type-id-197' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sata' type-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='850' column='1'/>
+        <var-decl name='sata' type-id='type-id-199' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='i2o' type-id='type-id-201' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='851' column='1'/>
+        <var-decl name='i2o' type-id='type-id-201' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='mac_addr' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='852' column='1'/>
+        <var-decl name='mac_addr' type-id='type-id-203' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ipv4_addr' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='853' column='1'/>
+        <var-decl name='ipv4_addr' type-id='type-id-205' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ipv6_addr' type-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='854' column='1'/>
+        <var-decl name='ipv6_addr' type-id='type-id-207' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='vlan' type-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='855' column='1'/>
+        <var-decl name='vlan' type-id='type-id-209' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='infiniband' type-id='type-id-211' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='856' column='1'/>
+        <var-decl name='infiniband' type-id='type-id-211' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='uart' type-id='type-id-214' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='857' column='1'/>
+        <var-decl name='uart' type-id='type-id-214' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='msg_vendor' type-id='type-id-216' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='858' column='1'/>
+        <var-decl name='msg_vendor' type-id='type-id-216' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='uart_flow_control' type-id='type-id-218' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='859' column='1'/>
+        <var-decl name='uart_flow_control' type-id='type-id-218' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sas' type-id='type-id-220' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='860' column='1'/>
+        <var-decl name='sas' type-id='type-id-220' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sas_ex' type-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='861' column='1'/>
+        <var-decl name='sas_ex' type-id='type-id-222' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='iscsi' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='862' column='1'/>
+        <var-decl name='iscsi' type-id='type-id-224' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='nvme' type-id='type-id-226' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='863' column='1'/>
+        <var-decl name='nvme' type-id='type-id-226' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='uri' type-id='type-id-228' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='864' column='1'/>
+        <var-decl name='uri' type-id='type-id-228' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ufs' type-id='type-id-230' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='865' column='1'/>
+        <var-decl name='ufs' type-id='type-id-230' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sd' type-id='type-id-232' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='866' column='1'/>
+        <var-decl name='sd' type-id='type-id-232' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='bt' type-id='type-id-234' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='867' column='1'/>
+        <var-decl name='bt' type-id='type-id-234' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='wifi' type-id='type-id-236' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='868' column='1'/>
+        <var-decl name='wifi' type-id='type-id-236' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='emmc' type-id='type-id-238' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='869' column='1'/>
+        <var-decl name='emmc' type-id='type-id-238' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='btle' type-id='type-id-240' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='870' column='1'/>
+        <var-decl name='btle' type-id='type-id-240' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='dns' type-id='type-id-242' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='871' column='1'/>
+        <var-decl name='dns' type-id='type-id-242' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='nvdimm' type-id='type-id-244' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='872' column='1'/>
+        <var-decl name='nvdimm' type-id='type-id-244' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='hd' type-id='type-id-246' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='873' column='1'/>
+        <var-decl name='hd' type-id='type-id-246' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='cdrom' type-id='type-id-248' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='874' column='1'/>
+        <var-decl name='cdrom' type-id='type-id-248' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='media_vendor' type-id='type-id-250' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='875' column='1'/>
+        <var-decl name='media_vendor' type-id='type-id-250' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='file' type-id='type-id-252' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='876' column='1'/>
+        <var-decl name='file' type-id='type-id-252' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='protocol' type-id='type-id-254' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='877' column='1'/>
+        <var-decl name='protocol' type-id='type-id-254' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='883' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='firmware_file' type-id='type-id-256' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='878' column='1'/>
+        <var-decl name='firmware_file' type-id='type-id-256' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='884' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='firmware_volume' type-id='type-id-258' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='879' column='1'/>
+        <var-decl name='firmware_volume' type-id='type-id-258' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='885' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='relative_offset' type-id='type-id-260' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='880' column='1'/>
+        <var-decl name='relative_offset' type-id='type-id-260' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='886' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='ramdisk' type-id='type-id-262' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='881' column='1'/>
+        <var-decl name='ramdisk' type-id='type-id-262' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='887' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='bios_boot' type-id='type-id-264' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='882' column='1'/>
+        <var-decl name='bios_boot' type-id='type-id-264' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='888' column='1'/>
       </data-member>
     </union-decl>
-    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='826' column='1' id='type-id-267'>
+    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='832' column='1' id='type-id-267'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='827' column='1'/>
+        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='833' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='8'>
-        <var-decl name='subtype' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='828' column='1'/>
+        <var-decl name='subtype' type-id='type-id-21' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='834' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='length' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='829' column='1'/>
+        <var-decl name='length' type-id='type-id-34' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='835' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_data' type-id='type-id-266' filepath='src/include/efivar/efivar-dp.h' line='883' column='1' id='type-id-135'/>
-    <typedef-decl name='efidp' type-id='type-id-268' filepath='src/include/efivar/efivar-dp.h' line='884' column='1' id='type-id-269'/>
-    <class-decl name='efi_ipv4_addr_t' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-270' visibility='default' filepath='src/include/efivar/efivar-types.h' line='31' column='1' id='type-id-271'>
+    <typedef-decl name='efidp_data' type-id='type-id-266' filepath='src/include/efivar/efivar-dp.h' line='889' column='1' id='type-id-135'/>
+    <typedef-decl name='efidp' type-id='type-id-268' filepath='src/include/efivar/efivar-dp.h' line='890' column='1' id='type-id-269'/>
+    <class-decl name='efi_ipv4_addr_t' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-270' visibility='default' filepath='src/include/efivar/efivar-types.h' line='35' column='1' id='type-id-271'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='addr' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-types.h' line='32' column='1'/>
+        <var-decl name='addr' type-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-types.h' line='36' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-271' filepath='src/include/efivar/efivar-types.h' line='33' column='1' id='type-id-270'/>
-    <class-decl name='efi_ipv6_addr_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-types.h' line='35' column='1' id='type-id-273'>
+    <typedef-decl name='efi_ipv4_addr_t' type-id='type-id-271' filepath='src/include/efivar/efivar-types.h' line='37' column='1' id='type-id-270'/>
+    <class-decl name='efi_ipv6_addr_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-types.h' line='39' column='1' id='type-id-273'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='addr' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-types.h' line='36' column='1'/>
+        <var-decl name='addr' type-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-types.h' line='40' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-273' filepath='src/include/efivar/efivar-types.h' line='37' column='1' id='type-id-272'/>
-    <union-decl name='efi_ip_addr_t' size-in-bits='128' naming-typedef-id='type-id-144' visibility='default' filepath='src/include/efivar/efivar-types.h' line='39' column='1' id='type-id-274'>
+    <typedef-decl name='efi_ipv6_addr_t' type-id='type-id-273' filepath='src/include/efivar/efivar-types.h' line='41' column='1' id='type-id-272'/>
+    <union-decl name='efi_ip_addr_t' size-in-bits='128' naming-typedef-id='type-id-144' visibility='default' filepath='src/include/efivar/efivar-types.h' line='43' column='1' id='type-id-274'>
       <data-member access='public'>
-        <var-decl name='addr' type-id='type-id-147' visibility='default' filepath='src/include/efivar/efivar-types.h' line='40' column='1'/>
+        <var-decl name='addr' type-id='type-id-147' visibility='default' filepath='src/include/efivar/efivar-types.h' line='44' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='v4' type-id='type-id-270' visibility='default' filepath='src/include/efivar/efivar-types.h' line='41' column='1'/>
+        <var-decl name='v4' type-id='type-id-270' visibility='default' filepath='src/include/efivar/efivar-types.h' line='45' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='v6' type-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-types.h' line='42' column='1'/>
+        <var-decl name='v6' type-id='type-id-272' visibility='default' filepath='src/include/efivar/efivar-types.h' line='46' column='1'/>
       </data-member>
     </union-decl>
-    <typedef-decl name='efi_ip_addr_t' type-id='type-id-274' filepath='src/include/efivar/efivar-types.h' line='43' column='1' id='type-id-144'/>
+    <typedef-decl name='efi_ip_addr_t' type-id='type-id-274' filepath='src/include/efivar/efivar-types.h' line='47' column='1' id='type-id-144'/>
     <class-decl name='efi_load_option_s' size-in-bits='48' is-struct='yes' visibility='default' filepath='src/loadopt.c' line='17' column='1' id='type-id-158'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='attributes' type-id='type-id-33' visibility='default' filepath='src/loadopt.c' line='18' column='1'/>
@@ -2250,7 +2272,7 @@
     <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-281'/>
     <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-140'/>
     <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-282'/>
-    <function-decl name='efi_get_verbose' filepath='src/include/efivar/efivar.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_get_verbose' filepath='src/include/efivar/efivar.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
       <return type-id='type-id-18'/>
     </function-decl>
     <function-decl name='efi_loadopt_create' mangled-name='efi_loadopt_create' filepath='src/loadopt.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_loadopt_create@@libefiboot.so.0'>
diff --git a/src/libefiboot.map.in b/src/libefiboot.map.in
index 0771eac5..0899dae1 100644
--- a/src/libefiboot.map.in
+++ b/src/libefiboot.map.in
@@ -37,3 +37,7 @@ LIBEFIBOOT_1.30 {
 LIBEFIBOOT_1.31 {
 	global:	efi_get_libefiboot_version;
 } LIBEFIBOOT_1.30;
+
+LIBEFIBOOT_1.32 {
+	global:	efi_generate_ipv4_device_path_with_uri;
+} LIBEFIBOOT_1.31;
diff --git a/src/libefisec.abixml b/src/libefisec.abixml
index eb5d7b9a..af82c596 100644
--- a/src/libefisec.abixml
+++ b/src/libefisec.abixml
@@ -111,47 +111,47 @@
       <enumerator name='ESL_ITER_NEW_LIST' value='2'/>
     </enum-decl>
     <typedef-decl name='esl_iter_status_t' type-id='type-id-50' filepath='src/esl-iter.h' line='40' column='1' id='type-id-51'/>
-    <typedef-decl name='efi_secdb_t' type-id='type-id-52' filepath='src/include/efivar/efisec-secdb.h' line='10' column='1' id='type-id-53'/>
-    <union-decl name='efi_secdb_data_t' size-in-bits='2048' naming-typedef-id='type-id-54' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='12' column='1' id='type-id-55'>
+    <typedef-decl name='efi_secdb_t' type-id='type-id-52' filepath='src/include/efivar/efisec-secdb.h' line='14' column='1' id='type-id-53'/>
+    <union-decl name='efi_secdb_data_t' size-in-bits='2048' naming-typedef-id='type-id-54' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='16' column='1' id='type-id-55'>
       <data-member access='public'>
-        <var-decl name='sha1' type-id='type-id-56' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='13' column='1'/>
+        <var-decl name='sha1' type-id='type-id-56' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='17' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sha224' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='14' column='1'/>
+        <var-decl name='sha224' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='18' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sha256' type-id='type-id-58' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='15' column='1'/>
+        <var-decl name='sha256' type-id='type-id-58' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='19' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sha384' type-id='type-id-59' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='16' column='1'/>
+        <var-decl name='sha384' type-id='type-id-59' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='20' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='sha512' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='17' column='1'/>
+        <var-decl name='sha512' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='21' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='rsa2048' type-id='type-id-61' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='18' column='1'/>
+        <var-decl name='rsa2048' type-id='type-id-61' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='22' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='rsa2048_sha1' type-id='type-id-61' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='19' column='1'/>
+        <var-decl name='rsa2048_sha1' type-id='type-id-61' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='23' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='rsa2048_sha256' type-id='type-id-61' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='20' column='1'/>
+        <var-decl name='rsa2048_sha256' type-id='type-id-61' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='24' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='x509_sha256_t' type-id='type-id-62' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='21' column='1'/>
+        <var-decl name='x509_sha256_t' type-id='type-id-62' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='25' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='x509_sha384_t' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='22' column='1'/>
+        <var-decl name='x509_sha384_t' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='26' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='x509_sha512_t' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='23' column='1'/>
+        <var-decl name='x509_sha512_t' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='27' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='raw' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='24' column='1'/>
+        <var-decl name='raw' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efisec-secdb.h' line='28' column='1'/>
       </data-member>
     </union-decl>
-    <typedef-decl name='efi_secdb_data_t' type-id='type-id-55' filepath='src/include/efivar/efisec-secdb.h' line='25' column='1' id='type-id-54'/>
-    <enum-decl name='efi_secdb_type_t' naming-typedef-id='type-id-65' filepath='src/include/efivar/efisec-secdb.h' line='27' column='1' id='type-id-66'>
+    <typedef-decl name='efi_secdb_data_t' type-id='type-id-55' filepath='src/include/efivar/efisec-secdb.h' line='29' column='1' id='type-id-54'/>
+    <enum-decl name='efi_secdb_type_t' naming-typedef-id='type-id-65' filepath='src/include/efivar/efisec-secdb.h' line='31' column='1' id='type-id-66'>
       <underlying-type type-id='type-id-45'/>
       <enumerator name='X509_CERT' value='0'/>
       <enumerator name='X509_SHA256' value='1'/>
@@ -167,101 +167,101 @@
       <enumerator name='RSA2048_SHA256' value='11'/>
       <enumerator name='MAX_SECDB_TYPE' value='12'/>
     </enum-decl>
-    <typedef-decl name='efi_secdb_type_t' type-id='type-id-66' filepath='src/include/efivar/efisec-secdb.h' line='41' column='1' id='type-id-65'/>
-    <enum-decl name='efi_secdb_flag_t' naming-typedef-id='type-id-67' filepath='src/include/efivar/efisec-secdb.h' line='43' column='1' id='type-id-68'>
+    <typedef-decl name='efi_secdb_type_t' type-id='type-id-66' filepath='src/include/efivar/efisec-secdb.h' line='45' column='1' id='type-id-65'/>
+    <enum-decl name='efi_secdb_flag_t' naming-typedef-id='type-id-67' filepath='src/include/efivar/efisec-secdb.h' line='47' column='1' id='type-id-68'>
       <underlying-type type-id='type-id-45'/>
       <enumerator name='EFI_SECDB_SORT' value='0'/>
       <enumerator name='EFI_SECDB_SORT_DATA' value='1'/>
       <enumerator name='EFI_SECDB_SORT_DESCENDING' value='2'/>
     </enum-decl>
-    <typedef-decl name='efi_secdb_flag_t' type-id='type-id-68' filepath='src/include/efivar/efisec-secdb.h' line='47' column='1' id='type-id-67'/>
-    <typedef-decl name='efi_sha1_hash_t' type-id='type-id-30' filepath='src/include/efivar/efisec-types.h' line='17' column='1' id='type-id-56'/>
-    <typedef-decl name='efi_sha224_hash_t' type-id='type-id-33' filepath='src/include/efivar/efisec-types.h' line='18' column='1' id='type-id-57'/>
-    <typedef-decl name='efi_sha256_hash_t' type-id='type-id-35' filepath='src/include/efivar/efisec-types.h' line='19' column='1' id='type-id-58'/>
-    <typedef-decl name='efi_sha384_hash_t' type-id='type-id-37' filepath='src/include/efivar/efisec-types.h' line='20' column='1' id='type-id-59'/>
-    <typedef-decl name='efi_sha512_hash_t' type-id='type-id-39' filepath='src/include/efivar/efisec-types.h' line='21' column='1' id='type-id-60'/>
-    <typedef-decl name='efi_rsa2048_sig_t' type-id='type-id-31' filepath='src/include/efivar/efisec-types.h' line='22' column='1' id='type-id-61'/>
-    <class-decl name='efi_cert_x509_sha256_t' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-62' visibility='default' filepath='src/include/efivar/efisec-types.h' line='35' column='1' id='type-id-69'>
+    <typedef-decl name='efi_secdb_flag_t' type-id='type-id-68' filepath='src/include/efivar/efisec-secdb.h' line='51' column='1' id='type-id-67'/>
+    <typedef-decl name='efi_sha1_hash_t' type-id='type-id-30' filepath='src/include/efivar/efisec-types.h' line='21' column='1' id='type-id-56'/>
+    <typedef-decl name='efi_sha224_hash_t' type-id='type-id-33' filepath='src/include/efivar/efisec-types.h' line='22' column='1' id='type-id-57'/>
+    <typedef-decl name='efi_sha256_hash_t' type-id='type-id-35' filepath='src/include/efivar/efisec-types.h' line='23' column='1' id='type-id-58'/>
+    <typedef-decl name='efi_sha384_hash_t' type-id='type-id-37' filepath='src/include/efivar/efisec-types.h' line='24' column='1' id='type-id-59'/>
+    <typedef-decl name='efi_sha512_hash_t' type-id='type-id-39' filepath='src/include/efivar/efisec-types.h' line='25' column='1' id='type-id-60'/>
+    <typedef-decl name='efi_rsa2048_sig_t' type-id='type-id-31' filepath='src/include/efivar/efisec-types.h' line='26' column='1' id='type-id-61'/>
+    <class-decl name='efi_cert_x509_sha256_t' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-62' visibility='default' filepath='src/include/efivar/efisec-types.h' line='39' column='1' id='type-id-69'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='to_be_signed_hash' type-id='type-id-58' visibility='default' filepath='src/include/efivar/efisec-types.h' line='36' column='1'/>
+        <var-decl name='to_be_signed_hash' type-id='type-id-58' visibility='default' filepath='src/include/efivar/efisec-types.h' line='40' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='time_of_revocation' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efisec-types.h' line='37' column='1'/>
+        <var-decl name='time_of_revocation' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efisec-types.h' line='41' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_cert_x509_sha256_t' type-id='type-id-69' filepath='src/include/efivar/efisec-types.h' line='38' column='1' id='type-id-62'/>
-    <class-decl name='efi_cert_x509_sha384_t' size-in-bits='512' is-struct='yes' naming-typedef-id='type-id-63' visibility='default' filepath='src/include/efivar/efisec-types.h' line='40' column='1' id='type-id-71'>
+    <typedef-decl name='efi_cert_x509_sha256_t' type-id='type-id-69' filepath='src/include/efivar/efisec-types.h' line='42' column='1' id='type-id-62'/>
+    <class-decl name='efi_cert_x509_sha384_t' size-in-bits='512' is-struct='yes' naming-typedef-id='type-id-63' visibility='default' filepath='src/include/efivar/efisec-types.h' line='44' column='1' id='type-id-71'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='to_be_signed_hash' type-id='type-id-59' visibility='default' filepath='src/include/efivar/efisec-types.h' line='41' column='1'/>
+        <var-decl name='to_be_signed_hash' type-id='type-id-59' visibility='default' filepath='src/include/efivar/efisec-types.h' line='45' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='time_of_revocation' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efisec-types.h' line='42' column='1'/>
+        <var-decl name='time_of_revocation' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efisec-types.h' line='46' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_cert_x509_sha384_t' type-id='type-id-71' filepath='src/include/efivar/efisec-types.h' line='43' column='1' id='type-id-63'/>
-    <class-decl name='efi_cert_x509_sha512_t' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-64' visibility='default' filepath='src/include/efivar/efisec-types.h' line='45' column='1' id='type-id-72'>
+    <typedef-decl name='efi_cert_x509_sha384_t' type-id='type-id-71' filepath='src/include/efivar/efisec-types.h' line='47' column='1' id='type-id-63'/>
+    <class-decl name='efi_cert_x509_sha512_t' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-64' visibility='default' filepath='src/include/efivar/efisec-types.h' line='49' column='1' id='type-id-72'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='to_be_signed_hash' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efisec-types.h' line='46' column='1'/>
+        <var-decl name='to_be_signed_hash' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efisec-types.h' line='50' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='time_of_revocation' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efisec-types.h' line='47' column='1'/>
+        <var-decl name='time_of_revocation' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efisec-types.h' line='51' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_cert_x509_sha512_t' type-id='type-id-72' filepath='src/include/efivar/efisec-types.h' line='48' column='1' id='type-id-64'/>
-    <class-decl name='efi_guid_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-types.h' line='13' column='1' id='type-id-74'>
+    <typedef-decl name='efi_cert_x509_sha512_t' type-id='type-id-72' filepath='src/include/efivar/efisec-types.h' line='52' column='1' id='type-id-64'/>
+    <class-decl name='efi_guid_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-types.h' line='17' column='1' id='type-id-74'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='a' type-id='type-id-7' visibility='default' filepath='src/include/efivar/efivar-types.h' line='14' column='1'/>
+        <var-decl name='a' type-id='type-id-7' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='b' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-types.h' line='15' column='1'/>
+        <var-decl name='b' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-types.h' line='19' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='c' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-types.h' line='16' column='1'/>
+        <var-decl name='c' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-types.h' line='20' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='d' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-types.h' line='17' column='1'/>
+        <var-decl name='d' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-types.h' line='21' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='e' type-id='type-id-41' visibility='default' filepath='src/include/efivar/efivar-types.h' line='18' column='1'/>
+        <var-decl name='e' type-id='type-id-41' visibility='default' filepath='src/include/efivar/efivar-types.h' line='22' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_guid_t' type-id='type-id-74' filepath='src/include/efivar/efivar-types.h' line='19' column='1' id='type-id-73'/>
-    <class-decl name='efi_time_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='69' column='1' id='type-id-76'>
+    <typedef-decl name='efi_guid_t' type-id='type-id-74' filepath='src/include/efivar/efivar-types.h' line='23' column='1' id='type-id-73'/>
+    <class-decl name='efi_time_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-types.h' line='73' column='1' id='type-id-76'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='year' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-types.h' line='70' column='1'/>
+        <var-decl name='year' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-types.h' line='74' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='month' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='71' column='1'/>
+        <var-decl name='month' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='75' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='24'>
-        <var-decl name='day' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='72' column='1'/>
+        <var-decl name='day' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='76' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hour' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='73' column='1'/>
+        <var-decl name='hour' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='77' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='minute' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='74' column='1'/>
+        <var-decl name='minute' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='78' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='second' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='75' column='1'/>
+        <var-decl name='second' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='79' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='56'>
-        <var-decl name='pad1' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='76' column='1'/>
+        <var-decl name='pad1' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='80' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='nanosecond' type-id='type-id-7' visibility='default' filepath='src/include/efivar/efivar-types.h' line='77' column='1'/>
+        <var-decl name='nanosecond' type-id='type-id-7' visibility='default' filepath='src/include/efivar/efivar-types.h' line='81' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='timezone' type-id='type-id-77' visibility='default' filepath='src/include/efivar/efivar-types.h' line='78' column='1'/>
+        <var-decl name='timezone' type-id='type-id-77' visibility='default' filepath='src/include/efivar/efivar-types.h' line='82' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='112'>
-        <var-decl name='daylight' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='79' column='1'/>
+        <var-decl name='daylight' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='83' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='120'>
-        <var-decl name='pad2' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='80' column='1'/>
+        <var-decl name='pad2' type-id='type-id-29' visibility='default' filepath='src/include/efivar/efivar-types.h' line='84' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efi_time_t' type-id='type-id-76' filepath='src/include/efivar/efivar-types.h' line='81' column='1' id='type-id-70'/>
+    <typedef-decl name='efi_time_t' type-id='type-id-76' filepath='src/include/efivar/efivar-types.h' line='85' column='1' id='type-id-70'/>
     <class-decl name='list_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/list.h' line='17' column='1' id='type-id-78'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='next' type-id='type-id-79' visibility='default' filepath='src/list.h' line='18' column='1'/>
@@ -503,17 +503,17 @@
       <parameter type-id='type-id-121'/>
       <return type-id='type-id-107'/>
     </function-decl>
-    <function-decl name='efi_guid_to_id_guid' filepath='src/include/efivar/efivar.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_guid_to_id_guid' filepath='src/include/efivar/efivar.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-87'/>
       <parameter type-id='type-id-113'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='efi_guid_cmp' filepath='src/include/efivar/efivar.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_guid_cmp' filepath='src/include/efivar/efivar.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-87'/>
       <parameter type-id='type-id-87'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='efi_error_set' filepath='src/include/efivar/efivar.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_error_set' filepath='src/include/efivar/efivar.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-1'/>
       <parameter type-id='type-id-1'/>
       <parameter type-id='type-id-4'/>
@@ -522,11 +522,11 @@
       <parameter is-variadic='yes'/>
       <return type-id='type-id-4'/>
     </function-decl>
-    <function-decl name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
       <parameter type-id='type-id-4'/>
       <return type-id='type-id-2'/>
     </function-decl>
-    <function-decl name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
+    <function-decl name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64'>
       <return type-id='type-id-110'/>
     </function-decl>
     <function-decl name='efi_secdb_new' mangled-name='efi_secdb_new' filepath='src/secdb.c' line='15' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_secdb_new@@LIBEFISEC_1.38'>
diff --git a/src/libefivar.abixml b/src/libefivar.abixml
index 64379078..16d9eada 100644
--- a/src/libefivar.abixml
+++ b/src/libefivar.abixml
@@ -69,6 +69,7 @@
     <elf-symbol name='efidp_make_sas' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efidp_make_sata' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efidp_make_scsi' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
+    <elf-symbol name='efidp_make_uri' version='LIBEFIVAR_1.39' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efidp_make_vendor' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efidp_parse_device_node' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
     <elf-symbol name='efidp_parse_device_path' version='libefivar.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
@@ -275,11 +276,11 @@
       <parameter type-id='type-id-33' name='cidstr' filepath='src/dp-acpi.c' line='291' column='1'/>
       <return type-id='type-id-36'/>
     </function-decl>
-    <function-decl name='efi_set_loglevel' mangled-name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_loglevel@@LIBEFIVAR_1.38'>
+    <function-decl name='efi_set_loglevel' mangled-name='efi_set_loglevel' filepath='src/include/efivar/efivar.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_set_loglevel@@LIBEFIVAR_1.38'>
       <parameter type-id='type-id-21'/>
       <return type-id='type-id-19'/>
     </function-decl>
-    <function-decl name='efi_get_logfile' mangled-name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_logfile@@LIBEFIVAR_1.36'>
+    <function-decl name='efi_get_logfile' mangled-name='efi_get_logfile' filepath='src/include/efivar/efivar.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_get_logfile@@LIBEFIVAR_1.36'>
       <return type-id='type-id-30'/>
     </function-decl>
     <function-decl name='fflush' filepath='/usr/include/stdio.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -332,12 +333,12 @@
       <parameter type-id='type-id-37' name='hardware_device' filepath='src/dp-hw.c' line='92' column='1'/>
       <return type-id='type-id-36'/>
     </function-decl>
-    <function-decl name='efi_guid_to_str' mangled-name='efi_guid_to_str' filepath='src/include/efivar/efivar.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_str@@libefivar.so.0'>
+    <function-decl name='efi_guid_to_str' mangled-name='efi_guid_to_str' filepath='src/include/efivar/efivar.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_to_str@@libefivar.so.0'>
       <parameter type-id='type-id-41'/>
       <parameter type-id='type-id-38'/>
       <return type-id='type-id-21'/>
     </function-decl>
-    <function-decl name='efi_guid_cmp' mangled-name='efi_guid_cmp' filepath='src/include/efivar/efivar.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_cmp@@LIBEFIVAR_0.24'>
+    <function-decl name='efi_guid_cmp' mangled-name='efi_guid_cmp' filepath='src/include/efivar/efivar.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_cmp@@LIBEFIVAR_0.24'>
       <parameter type-id='type-id-41'/>
       <parameter type-id='type-id-41'/>
       <return type-id='type-id-21'/>
@@ -365,7 +366,7 @@
       <parameter type-id='type-id-42' name='signature_type' filepath='src/dp-media.c' line='172' column='1'/>
       <return type-id='type-id-36'/>
     </function-decl>
-    <function-decl name='efi_guid_is_zero' mangled-name='efi_guid_is_empty' filepath='src/include/efivar/efivar.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_is_empty@@libefivar.so.0'>
+    <function-decl name='efi_guid_is_zero' mangled-name='efi_guid_is_empty' filepath='src/include/efivar/efivar.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efi_guid_is_empty@@libefivar.so.0'>
       <parameter type-id='type-id-41'/>
       <return type-id='type-id-21'/>
     </function-decl>
@@ -379,1149 +380,1156 @@
     <type-decl name='short int' size-in-bits='16' id='type-id-44'/>
     <typedef-decl name='int16_t' type-id='type-id-45' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-46'/>
     <typedef-decl name='__int16_t' type-id='type-id-44' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-45'/>
-    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-47'/>
-    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
-    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-49'/>
-    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-50'/>
+    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-47'/>
+    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-48'/>
+    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-49'/>
+    <qualified-type-def type-id='type-id-49' const='yes' id='type-id-50'/>
+    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-51'/>
     <function-decl name='efidp_make_mac_addr' mangled-name='efidp_make_mac_addr' filepath='src/dp-message.c' line='621' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_mac_addr@@libefivar.so.0'>
       <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='621' column='1'/>
       <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='621' column='1'/>
       <parameter type-id='type-id-42' name='if_type' filepath='src/dp-message.c' line='621' column='1'/>
-      <parameter type-id='type-id-49' name='mac_addr' filepath='src/dp-message.c' line='622' column='1'/>
+      <parameter type-id='type-id-50' name='mac_addr' filepath='src/dp-message.c' line='622' column='1'/>
       <parameter type-id='type-id-36' name='mac_addr_size' filepath='src/dp-message.c' line='622' column='1'/>
       <return type-id='type-id-36'/>
     </function-decl>
-    <function-decl name='efidp_make_ipv4' mangled-name='efidp_make_ipv4' filepath='src/dp-message.c' line='642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4@@libefivar.so.0'>
+    <function-decl name='efidp_make_uri' mangled-name='efidp_make_uri' filepath='src/dp-message.c' line='642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_uri@@LIBEFIVAR_1.39'>
       <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='642' column='1'/>
       <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='642' column='1'/>
-      <parameter type-id='type-id-37' name='local' filepath='src/dp-message.c' line='642' column='1'/>
-      <parameter type-id='type-id-37' name='remote' filepath='src/dp-message.c' line='642' column='1'/>
-      <parameter type-id='type-id-37' name='gateway' filepath='src/dp-message.c' line='643' column='1'/>
-      <parameter type-id='type-id-37' name='netmask' filepath='src/dp-message.c' line='643' column='1'/>
-      <parameter type-id='type-id-51' name='local_port' filepath='src/dp-message.c' line='644' column='1'/>
-      <parameter type-id='type-id-51' name='remote_port' filepath='src/dp-message.c' line='644' column='1'/>
-      <parameter type-id='type-id-51' name='protocol' filepath='src/dp-message.c' line='645' column='1'/>
-      <parameter type-id='type-id-21' name='is_static' filepath='src/dp-message.c' line='645' column='1'/>
+      <parameter type-id='type-id-47' name='uristring' filepath='src/dp-message.c' line='642' column='1'/>
       <return type-id='type-id-36'/>
     </function-decl>
-    <function-decl name='efidp_make_scsi' mangled-name='efidp_make_scsi' filepath='src/dp-message.c' line='671' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_scsi@@libefivar.so.0'>
-      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='671' column='1'/>
-      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='671' column='1'/>
-      <parameter type-id='type-id-51' name='target' filepath='src/dp-message.c' line='671' column='1'/>
-      <parameter type-id='type-id-51' name='lun' filepath='src/dp-message.c' line='671' column='1'/>
+    <function-decl name='efidp_make_ipv4' mangled-name='efidp_make_ipv4' filepath='src/dp-message.c' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_ipv4@@libefivar.so.0'>
+      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='661' column='1'/>
+      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='661' column='1'/>
+      <parameter type-id='type-id-37' name='local' filepath='src/dp-message.c' line='661' column='1'/>
+      <parameter type-id='type-id-37' name='remote' filepath='src/dp-message.c' line='661' column='1'/>
+      <parameter type-id='type-id-37' name='gateway' filepath='src/dp-message.c' line='662' column='1'/>
+      <parameter type-id='type-id-37' name='netmask' filepath='src/dp-message.c' line='662' column='1'/>
+      <parameter type-id='type-id-52' name='local_port' filepath='src/dp-message.c' line='663' column='1'/>
+      <parameter type-id='type-id-52' name='remote_port' filepath='src/dp-message.c' line='663' column='1'/>
+      <parameter type-id='type-id-52' name='protocol' filepath='src/dp-message.c' line='664' column='1'/>
+      <parameter type-id='type-id-21' name='is_static' filepath='src/dp-message.c' line='664' column='1'/>
       <return type-id='type-id-36'/>
     </function-decl>
-    <function-decl name='efidp_make_nvme' mangled-name='efidp_make_nvme' filepath='src/dp-message.c' line='689' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvme@@libefivar.so.0'>
-      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='689' column='1'/>
-      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='689' column='1'/>
-      <parameter type-id='type-id-37' name='namespace_id' filepath='src/dp-message.c' line='689' column='1'/>
-      <parameter type-id='type-id-35' name='ieee_eui_64' filepath='src/dp-message.c' line='690' column='1'/>
+    <function-decl name='efidp_make_scsi' mangled-name='efidp_make_scsi' filepath='src/dp-message.c' line='690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_scsi@@libefivar.so.0'>
+      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='690' column='1'/>
+      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='690' column='1'/>
+      <parameter type-id='type-id-52' name='target' filepath='src/dp-message.c' line='690' column='1'/>
+      <parameter type-id='type-id-52' name='lun' filepath='src/dp-message.c' line='690' column='1'/>
       <return type-id='type-id-36'/>
     </function-decl>
-    <function-decl name='efidp_make_sata' mangled-name='efidp_make_sata' filepath='src/dp-message.c' line='715' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata@@libefivar.so.0'>
-      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='715' column='1'/>
-      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='715' column='1'/>
-      <parameter type-id='type-id-51' name='hba_port' filepath='src/dp-message.c' line='715' column='1'/>
-      <parameter type-id='type-id-46' name='port_multiplier_port' filepath='src/dp-message.c' line='716' column='1'/>
-      <parameter type-id='type-id-51' name='lun' filepath='src/dp-message.c' line='716' column='1'/>
+    <function-decl name='efidp_make_nvme' mangled-name='efidp_make_nvme' filepath='src/dp-message.c' line='708' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvme@@libefivar.so.0'>
+      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='708' column='1'/>
+      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='708' column='1'/>
+      <parameter type-id='type-id-37' name='namespace_id' filepath='src/dp-message.c' line='708' column='1'/>
+      <parameter type-id='type-id-35' name='ieee_eui_64' filepath='src/dp-message.c' line='709' column='1'/>
       <return type-id='type-id-36'/>
     </function-decl>
-    <function-decl name='efidp_make_atapi' mangled-name='efidp_make_atapi' filepath='src/dp-message.c' line='737' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi@@libefivar.so.0'>
-      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='737' column='1'/>
-      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='737' column='1'/>
-      <parameter type-id='type-id-51' name='primary' filepath='src/dp-message.c' line='737' column='1'/>
-      <parameter type-id='type-id-51' name='slave' filepath='src/dp-message.c' line='738' column='1'/>
-      <parameter type-id='type-id-51' name='lun' filepath='src/dp-message.c' line='738' column='1'/>
+    <function-decl name='efidp_make_sata' mangled-name='efidp_make_sata' filepath='src/dp-message.c' line='734' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sata@@libefivar.so.0'>
+      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='734' column='1'/>
+      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='734' column='1'/>
+      <parameter type-id='type-id-52' name='hba_port' filepath='src/dp-message.c' line='734' column='1'/>
+      <parameter type-id='type-id-46' name='port_multiplier_port' filepath='src/dp-message.c' line='735' column='1'/>
+      <parameter type-id='type-id-52' name='lun' filepath='src/dp-message.c' line='735' column='1'/>
       <return type-id='type-id-36'/>
     </function-decl>
-    <function-decl name='efidp_make_sas' mangled-name='efidp_make_sas' filepath='src/dp-message.c' line='760' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sas@@libefivar.so.0'>
-      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='760' column='1'/>
-      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='760' column='1'/>
-      <parameter type-id='type-id-43' name='sas_address' filepath='src/dp-message.c' line='760' column='1'/>
+    <function-decl name='efidp_make_atapi' mangled-name='efidp_make_atapi' filepath='src/dp-message.c' line='756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_atapi@@libefivar.so.0'>
+      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='756' column='1'/>
+      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='756' column='1'/>
+      <parameter type-id='type-id-52' name='primary' filepath='src/dp-message.c' line='756' column='1'/>
+      <parameter type-id='type-id-52' name='slave' filepath='src/dp-message.c' line='757' column='1'/>
+      <parameter type-id='type-id-52' name='lun' filepath='src/dp-message.c' line='757' column='1'/>
       <return type-id='type-id-36'/>
     </function-decl>
-    <function-decl name='efidp_make_nvdimm' mangled-name='efidp_make_nvdimm' filepath='src/dp-message.c' line='785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvdimm@@LIBEFIVAR_1.33'>
-      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='785' column='1'/>
-      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='785' column='1'/>
-      <parameter type-id='type-id-50' name='uuid' filepath='src/dp-message.c' line='785' column='1'/>
+    <function-decl name='efidp_make_sas' mangled-name='efidp_make_sas' filepath='src/dp-message.c' line='779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_sas@@libefivar.so.0'>
+      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='779' column='1'/>
+      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='779' column='1'/>
+      <parameter type-id='type-id-43' name='sas_address' filepath='src/dp-message.c' line='779' column='1'/>
       <return type-id='type-id-36'/>
     </function-decl>
-    <function-decl name='efidp_make_emmc' mangled-name='efidp_make_emmc' filepath='src/dp-message.c' line='804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_emmc@@libefivar.so.0'>
+    <function-decl name='efidp_make_nvdimm' mangled-name='efidp_make_nvdimm' filepath='src/dp-message.c' line='804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_nvdimm@@LIBEFIVAR_1.33'>
       <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='804' column='1'/>
       <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='804' column='1'/>
-      <parameter type-id='type-id-37' name='slot_id' filepath='src/dp-message.c' line='804' column='1'/>
+      <parameter type-id='type-id-51' name='uuid' filepath='src/dp-message.c' line='804' column='1'/>
+      <return type-id='type-id-36'/>
+    </function-decl>
+    <function-decl name='efidp_make_emmc' mangled-name='efidp_make_emmc' filepath='src/dp-message.c' line='823' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='efidp_make_emmc@@libefivar.so.0'>
+      <parameter type-id='type-id-35' name='buf' filepath='src/dp-message.c' line='823' column='1'/>
+      <parameter type-id='type-id-36' name='size' filepath='src/dp-message.c' line='823' column='1'/>
+      <parameter type-id='type-id-37' name='slot_id' filepath='src/dp-message.c' line='823' column='1'/>
       <return type-id='type-id-36'/>
     </function-decl>
   </abi-instr>
   <abi-instr address-size='64' path='dp.c' comp-dir-path='src' language='LANG_C11'>
     <type-decl name='char' size-in-bits='8' id='type-id-1'/>
-    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='infinite' id='type-id-52'>
-      <subrange length='infinite' type-id='type-id-3' id='type-id-53'/>
+    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='infinite' id='type-id-53'>
+      <subrange length='infinite' type-id='type-id-3' id='type-id-54'/>
     </array-type-def>
-    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-54'/>
-    <array-type-def dimensions='1' type-id='type-id-55' size-in-bits='infinite' id='type-id-56'>
-      <subrange length='infinite' type-id='type-id-3' id='type-id-53'/>
+    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-55'/>
+    <array-type-def dimensions='1' type-id='type-id-56' size-in-bits='infinite' id='type-id-57'>
+      <subrange length='infinite' type-id='type-id-3' id='type-id-54'/>
     </array-type-def>
     <type-decl name='int' size-in-bits='32' id='type-id-21'/>
     <type-decl name='long int' size-in-bits='64' id='type-id-14'/>
-    <array-type-def dimensions='1' type-id='type-id-51' size-in-bits='infinite' id='type-id-57'>
-      <subrange length='infinite' type-id='type-id-3' id='type-id-53'/>
+    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='infinite' id='type-id-58'>
+      <subrange length='infinite' type-id='type-id-3' id='type-id-54'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-37' size-in-bits='128' id='type-id-58'>
-      <subrange length='4' type-id='type-id-3' id='type-id-59'/>
+    <array-type-def dimensions='1' type-id='type-id-37' size-in-bits='128' id='type-id-59'>
+      <subrange length='4' type-id='type-id-3' id='type-id-60'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-37' size-in-bits='infinite' id='type-id-60'>
-      <subrange length='infinite' type-id='type-id-3' id='type-id-53'/>
+    <array-type-def dimensions='1' type-id='type-id-37' size-in-bits='infinite' id='type-id-61'>
+      <subrange length='infinite' type-id='type-id-3' id='type-id-54'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-43' size-in-bits='128' id='type-id-61'>
-      <subrange length='2' type-id='type-id-3' id='type-id-62'/>
+    <array-type-def dimensions='1' type-id='type-id-43' size-in-bits='128' id='type-id-62'>
+      <subrange length='2' type-id='type-id-3' id='type-id-63'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='128' id='type-id-63'>
-      <subrange length='16' type-id='type-id-3' id='type-id-64'/>
+    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='128' id='type-id-64'>
+      <subrange length='16' type-id='type-id-3' id='type-id-65'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='256' id='type-id-65'>
-      <subrange length='32' type-id='type-id-3' id='type-id-66'/>
+    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='256' id='type-id-66'>
+      <subrange length='32' type-id='type-id-3' id='type-id-67'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='32' id='type-id-67'>
-      <subrange length='4' type-id='type-id-3' id='type-id-59'/>
+    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='32' id='type-id-68'>
+      <subrange length='4' type-id='type-id-3' id='type-id-60'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='48' id='type-id-68'>
-      <subrange length='6' type-id='type-id-3' id='type-id-69'/>
+    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='48' id='type-id-69'>
+      <subrange length='6' type-id='type-id-3' id='type-id-70'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='64' id='type-id-70'>
-      <subrange length='8' type-id='type-id-3' id='type-id-71'/>
+    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='64' id='type-id-71'>
+      <subrange length='8' type-id='type-id-3' id='type-id-72'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='infinite' id='type-id-72'>
-      <subrange length='infinite' type-id='type-id-3' id='type-id-53'/>
+    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='infinite' id='type-id-73'>
+      <subrange length='infinite' type-id='type-id-3' id='type-id-54'/>
     </array-type-def>
-    <type-decl name='unsigned char' size-in-bits='8' id='type-id-73'/>
+    <type-decl name='unsigned char' size-in-bits='8' id='type-id-74'/>
     <type-decl name='unsigned int' size-in-bits='32' id='type-id-11'/>
     <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
     <type-decl name='unsigned short int' size-in-bits='16' id='type-id-25'/>
-    <type-decl name='variadic parameter type' id='type-id-74'/>
+    <type-decl name='variadic parameter type' id='type-id-75'/>
     <type-decl name='void' id='type-id-19'/>
-    <class-decl name='efidp_header' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='23' column='1' id='type-id-76'>
+    <class-decl name='efidp_header' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' id='type-id-77'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='type' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='24' column='1'/>
+        <var-decl name='type' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='28' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='8'>
-        <var-decl name='subtype' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='25' column='1'/>
+        <var-decl name='subtype' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='29' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='length' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='26' column='1'/>
+        <var-decl name='length' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='30' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_header' type-id='type-id-76' filepath='src/include/efivar/efivar-dp.h' line='27' column='1' id='type-id-75'/>
-    <typedef-decl name='efidp_boolean' type-id='type-id-42' filepath='src/include/efivar/efivar-dp.h' line='30' column='1' id='type-id-77'/>
-    <class-decl name='efidp_pci' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='42' column='1' id='type-id-79'>
+    <typedef-decl name='efidp_header' type-id='type-id-77' filepath='src/include/efivar/efivar-dp.h' line='31' column='1' id='type-id-76'/>
+    <typedef-decl name='efidp_boolean' type-id='type-id-42' filepath='src/include/efivar/efivar-dp.h' line='34' column='1' id='type-id-78'/>
+    <class-decl name='efidp_pci' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-79' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' id='type-id-80'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='43' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='47' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='function' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='44' column='1'/>
+        <var-decl name='function' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='48' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='device' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='45' column='1'/>
+        <var-decl name='device' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='49' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_pci' type-id='type-id-79' filepath='src/include/efivar/efivar-dp.h' line='46' column='1' id='type-id-78'/>
-    <class-decl name='efidp_pccard' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-80' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='51' column='1' id='type-id-81'>
+    <typedef-decl name='efidp_pci' type-id='type-id-80' filepath='src/include/efivar/efivar-dp.h' line='50' column='1' id='type-id-79'/>
+    <class-decl name='efidp_pccard' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-81' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='55' column='1' id='type-id-82'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='52' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='56' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='function' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='53' column='1'/>
+        <var-decl name='function' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_pccard' type-id='type-id-81' filepath='src/include/efivar/efivar-dp.h' line='54' column='1' id='type-id-80'/>
-    <class-decl name='efidp_mmio' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-82' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='57' column='1' id='type-id-83'>
+    <typedef-decl name='efidp_pccard' type-id='type-id-82' filepath='src/include/efivar/efivar-dp.h' line='58' column='1' id='type-id-81'/>
+    <class-decl name='efidp_mmio' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-83' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='61' column='1' id='type-id-84'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='58' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='62' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='memory_type' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='59' column='1'/>
+        <var-decl name='memory_type' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='63' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='starting_address' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='60' column='1'/>
+        <var-decl name='starting_address' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='64' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='ending_address' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='61' column='1'/>
+        <var-decl name='ending_address' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_mmio' type-id='type-id-83' filepath='src/include/efivar/efivar-dp.h' line='62' column='1' id='type-id-82'/>
-    <class-decl name='efidp_hw_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-84' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='65' column='1' id='type-id-85'>
+    <typedef-decl name='efidp_mmio' type-id='type-id-84' filepath='src/include/efivar/efivar-dp.h' line='66' column='1' id='type-id-83'/>
+    <class-decl name='efidp_hw_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-85' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' id='type-id-86'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='66' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='70' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='67' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='68' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='72' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_hw_vendor' type-id='type-id-85' filepath='src/include/efivar/efivar-dp.h' line='69' column='1' id='type-id-84'/>
-    <class-decl name='efidp_controller' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-86' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='86' column='1' id='type-id-87'>
+    <typedef-decl name='efidp_hw_vendor' type-id='type-id-86' filepath='src/include/efivar/efivar-dp.h' line='73' column='1' id='type-id-85'/>
+    <class-decl name='efidp_controller' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-87' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='90' column='1' id='type-id-88'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='87' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='91' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='controller' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='88' column='1'/>
+        <var-decl name='controller' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_controller' type-id='type-id-87' filepath='src/include/efivar/efivar-dp.h' line='89' column='1' id='type-id-86'/>
-    <class-decl name='efidp_bmc' size-in-bits='104' is-struct='yes' naming-typedef-id='type-id-88' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='92' column='1' id='type-id-89'>
+    <typedef-decl name='efidp_controller' type-id='type-id-88' filepath='src/include/efivar/efivar-dp.h' line='93' column='1' id='type-id-87'/>
+    <class-decl name='efidp_bmc' size-in-bits='104' is-struct='yes' naming-typedef-id='type-id-89' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' id='type-id-90'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='93' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='97' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='interface_type' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='94' column='1'/>
+        <var-decl name='interface_type' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='98' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='base_addr' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='95' column='1'/>
+        <var-decl name='base_addr' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='99' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_bmc' type-id='type-id-89' filepath='src/include/efivar/efivar-dp.h' line='96' column='1' id='type-id-88'/>
-    <class-decl name='efidp_acpi_hid' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-90' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='106' column='1' id='type-id-91'>
+    <typedef-decl name='efidp_bmc' type-id='type-id-90' filepath='src/include/efivar/efivar-dp.h' line='100' column='1' id='type-id-89'/>
+    <class-decl name='efidp_acpi_hid' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-91' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' id='type-id-92'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='107' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='111' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='108' column='1'/>
+        <var-decl name='hid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='112' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='uid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='109' column='1'/>
+        <var-decl name='uid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='113' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_acpi_hid' type-id='type-id-91' filepath='src/include/efivar/efivar-dp.h' line='110' column='1' id='type-id-90'/>
-    <class-decl name='efidp_acpi_hid_ex' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-92' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='115' column='1' id='type-id-93'>
+    <typedef-decl name='efidp_acpi_hid' type-id='type-id-92' filepath='src/include/efivar/efivar-dp.h' line='114' column='1' id='type-id-91'/>
+    <class-decl name='efidp_acpi_hid_ex' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-93' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1' id='type-id-94'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='116' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='120' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='117' column='1'/>
+        <var-decl name='hid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='uid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='118' column='1'/>
+        <var-decl name='uid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='122' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='cid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='119' column='1'/>
+        <var-decl name='cid' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='123' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='hidstr' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='121' column='1'/>
+        <var-decl name='hidstr' type-id='type-id-53' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='125' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-93' filepath='src/include/efivar/efivar-dp.h' line='122' column='1' id='type-id-92'/>
-    <class-decl name='efidp_acpi_adr' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-94' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='156' column='1' id='type-id-95'>
+    <typedef-decl name='efidp_acpi_hid_ex' type-id='type-id-94' filepath='src/include/efivar/efivar-dp.h' line='126' column='1' id='type-id-93'/>
+    <class-decl name='efidp_acpi_adr' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-95' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='160' column='1' id='type-id-96'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='157' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='161' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='adr' type-id='type-id-60' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='158' column='1'/>
+        <var-decl name='adr' type-id='type-id-61' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='162' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_acpi_adr' type-id='type-id-95' filepath='src/include/efivar/efivar-dp.h' line='159' column='1' id='type-id-94'/>
-    <class-decl name='efidp_atapi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-96' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='317' column='1' id='type-id-97'>
+    <typedef-decl name='efidp_acpi_adr' type-id='type-id-96' filepath='src/include/efivar/efivar-dp.h' line='163' column='1' id='type-id-95'/>
+    <class-decl name='efidp_atapi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-97' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='321' column='1' id='type-id-98'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='318' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='322' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='primary' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='319' column='1'/>
+        <var-decl name='primary' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='323' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='slave' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='320' column='1'/>
+        <var-decl name='slave' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='324' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='lun' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='321' column='1'/>
+        <var-decl name='lun' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='325' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_atapi' type-id='type-id-97' filepath='src/include/efivar/efivar-dp.h' line='322' column='1' id='type-id-96'/>
-    <class-decl name='efidp_scsi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-98' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='327' column='1' id='type-id-99'>
+    <typedef-decl name='efidp_atapi' type-id='type-id-98' filepath='src/include/efivar/efivar-dp.h' line='326' column='1' id='type-id-97'/>
+    <class-decl name='efidp_scsi' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-99' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' id='type-id-100'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='328' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='332' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='target' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='329' column='1'/>
+        <var-decl name='target' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='333' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='lun' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='330' column='1'/>
+        <var-decl name='lun' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='334' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_scsi' type-id='type-id-99' filepath='src/include/efivar/efivar-dp.h' line='331' column='1' id='type-id-98'/>
-    <class-decl name='efidp_fc' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-100' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='336' column='1' id='type-id-101'>
+    <typedef-decl name='efidp_scsi' type-id='type-id-100' filepath='src/include/efivar/efivar-dp.h' line='335' column='1' id='type-id-99'/>
+    <class-decl name='efidp_fc' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-101' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1' id='type-id-102'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='337' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='341' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='338' column='1'/>
+        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='342' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='wwn' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='339' column='1'/>
+        <var-decl name='wwn' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='343' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='lun' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='340' column='1'/>
+        <var-decl name='lun' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_fc' type-id='type-id-101' filepath='src/include/efivar/efivar-dp.h' line='341' column='1' id='type-id-100'/>
-    <class-decl name='efidp_fcex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-102' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='344' column='1' id='type-id-103'>
+    <typedef-decl name='efidp_fc' type-id='type-id-102' filepath='src/include/efivar/efivar-dp.h' line='345' column='1' id='type-id-101'/>
+    <class-decl name='efidp_fcex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-103' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1' id='type-id-104'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='345' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='349' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='346' column='1'/>
+        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='350' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='wwn' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='347' column='1'/>
+        <var-decl name='wwn' type-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='351' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='lun' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='348' column='1'/>
+        <var-decl name='lun' type-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_fcex' type-id='type-id-103' filepath='src/include/efivar/efivar-dp.h' line='349' column='1' id='type-id-102'/>
-    <class-decl name='efidp_1394' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-104' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='352' column='1' id='type-id-105'>
+    <typedef-decl name='efidp_fcex' type-id='type-id-104' filepath='src/include/efivar/efivar-dp.h' line='353' column='1' id='type-id-103'/>
+    <class-decl name='efidp_1394' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-105' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' id='type-id-106'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='353' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='357' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='354' column='1'/>
+        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='358' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='guid' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='355' column='1'/>
+        <var-decl name='guid' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_1394' type-id='type-id-105' filepath='src/include/efivar/efivar-dp.h' line='356' column='1' id='type-id-104'/>
-    <class-decl name='efidp_usb' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-106' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='359' column='1' id='type-id-107'>
+    <typedef-decl name='efidp_1394' type-id='type-id-106' filepath='src/include/efivar/efivar-dp.h' line='360' column='1' id='type-id-105'/>
+    <class-decl name='efidp_usb' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-107' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' id='type-id-108'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='360' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='364' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='parent_port' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='361' column='1'/>
+        <var-decl name='parent_port' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='365' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='interface' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='362' column='1'/>
+        <var-decl name='interface' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_usb' type-id='type-id-107' filepath='src/include/efivar/efivar-dp.h' line='363' column='1' id='type-id-106'/>
-    <class-decl name='efidp_usb_class' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-108' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='366' column='1' id='type-id-109'>
+    <typedef-decl name='efidp_usb' type-id='type-id-108' filepath='src/include/efivar/efivar-dp.h' line='367' column='1' id='type-id-107'/>
+    <class-decl name='efidp_usb_class' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-109' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1' id='type-id-110'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='367' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_id' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='368' column='1'/>
+        <var-decl name='vendor_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='product_id' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='369' column='1'/>
+        <var-decl name='product_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='373' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='device_class' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='370' column='1'/>
+        <var-decl name='device_class' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='374' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='72'>
-        <var-decl name='device_subclass' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='371' column='1'/>
+        <var-decl name='device_subclass' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='375' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='device_protocol' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='372' column='1'/>
+        <var-decl name='device_protocol' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='376' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_usb_class' type-id='type-id-109' filepath='src/include/efivar/efivar-dp.h' line='373' column='1' id='type-id-108'/>
-    <class-decl name='efidp_usb_wwid' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-110' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='393' column='1' id='type-id-111'>
+    <typedef-decl name='efidp_usb_class' type-id='type-id-110' filepath='src/include/efivar/efivar-dp.h' line='377' column='1' id='type-id-109'/>
+    <class-decl name='efidp_usb_wwid' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-111' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='397' column='1' id='type-id-112'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='394' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='interface' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='395' column='1'/>
+        <var-decl name='interface' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='399' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='vendor_id' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='396' column='1'/>
+        <var-decl name='vendor_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='400' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='product_id' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='397' column='1'/>
+        <var-decl name='product_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='401' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='serial_number' type-id='type-id-57' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='398' column='1'/>
+        <var-decl name='serial_number' type-id='type-id-58' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_usb_wwid' type-id='type-id-111' filepath='src/include/efivar/efivar-dp.h' line='399' column='1' id='type-id-110'/>
-    <class-decl name='efidp_lun' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-112' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='402' column='1' id='type-id-113'>
+    <typedef-decl name='efidp_usb_wwid' type-id='type-id-112' filepath='src/include/efivar/efivar-dp.h' line='403' column='1' id='type-id-111'/>
+    <class-decl name='efidp_lun' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-113' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='406' column='1' id='type-id-114'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='403' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='407' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='lun' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='404' column='1'/>
+        <var-decl name='lun' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_lun' type-id='type-id-113' filepath='src/include/efivar/efivar-dp.h' line='405' column='1' id='type-id-112'/>
-    <class-decl name='efidp_sata' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-114' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='408' column='1' id='type-id-115'>
+    <typedef-decl name='efidp_lun' type-id='type-id-114' filepath='src/include/efivar/efivar-dp.h' line='409' column='1' id='type-id-113'/>
+    <class-decl name='efidp_sata' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-115' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1' id='type-id-116'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='409' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='413' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='hba_port' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='410' column='1'/>
+        <var-decl name='hba_port' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='414' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='port_multiplier_port' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='411' column='1'/>
+        <var-decl name='port_multiplier_port' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='415' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='lun' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='412' column='1'/>
+        <var-decl name='lun' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='416' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sata' type-id='type-id-115' filepath='src/include/efivar/efivar-dp.h' line='413' column='1' id='type-id-114'/>
-    <class-decl name='efidp_i2o' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-116' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='419' column='1' id='type-id-117'>
+    <typedef-decl name='efidp_sata' type-id='type-id-116' filepath='src/include/efivar/efivar-dp.h' line='417' column='1' id='type-id-115'/>
+    <class-decl name='efidp_i2o' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-117' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='423' column='1' id='type-id-118'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='420' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='424' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='target' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='421' column='1'/>
+        <var-decl name='target' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_i2o' type-id='type-id-117' filepath='src/include/efivar/efivar-dp.h' line='422' column='1' id='type-id-116'/>
-    <class-decl name='efidp_mac_addr' size-in-bits='296' is-struct='yes' naming-typedef-id='type-id-118' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='425' column='1' id='type-id-119'>
+    <typedef-decl name='efidp_i2o' type-id='type-id-118' filepath='src/include/efivar/efivar-dp.h' line='426' column='1' id='type-id-117'/>
+    <class-decl name='efidp_mac_addr' size-in-bits='296' is-struct='yes' naming-typedef-id='type-id-119' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-120'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='426' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='430' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='mac_addr' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='427' column='1'/>
+        <var-decl name='mac_addr' type-id='type-id-66' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='431' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='if_type' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='428' column='1'/>
+        <var-decl name='if_type' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='432' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_mac_addr' type-id='type-id-119' filepath='src/include/efivar/efivar-dp.h' line='429' column='1' id='type-id-118'/>
-    <class-decl name='efidp_ipv4_addr' size-in-bits='216' is-struct='yes' naming-typedef-id='type-id-120' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='437' column='1' id='type-id-121'>
+    <typedef-decl name='efidp_mac_addr' type-id='type-id-120' filepath='src/include/efivar/efivar-dp.h' line='433' column='1' id='type-id-119'/>
+    <class-decl name='efidp_ipv4_addr' size-in-bits='216' is-struct='yes' naming-typedef-id='type-id-121' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1' id='type-id-122'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='438' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='local_ipv4_addr' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='439' column='1'/>
+        <var-decl name='local_ipv4_addr' type-id='type-id-68' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='remote_ipv4_addr' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='440' column='1'/>
+        <var-decl name='remote_ipv4_addr' type-id='type-id-68' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='local_port' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='441' column='1'/>
+        <var-decl name='local_port' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='112'>
-        <var-decl name='remote_port' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='442' column='1'/>
+        <var-decl name='remote_port' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='446' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='protocol' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='443' column='1'/>
+        <var-decl name='protocol' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='447' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='static_ip_addr' type-id='type-id-77' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='444' column='1'/>
+        <var-decl name='static_ip_addr' type-id='type-id-78' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='448' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='152'>
-        <var-decl name='gateway' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='445' column='1'/>
+        <var-decl name='gateway' type-id='type-id-68' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='449' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='184'>
-        <var-decl name='netmask' type-id='type-id-67' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='446' column='1'/>
+        <var-decl name='netmask' type-id='type-id-68' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='450' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-121' filepath='src/include/efivar/efivar-dp.h' line='447' column='1' id='type-id-120'/>
-    <class-decl name='efidp_ipv6_addr' size-in-bits='360' is-struct='yes' naming-typedef-id='type-id-122' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='459' column='1' id='type-id-123'>
+    <typedef-decl name='efidp_ipv4_addr' type-id='type-id-122' filepath='src/include/efivar/efivar-dp.h' line='451' column='1' id='type-id-121'/>
+    <class-decl name='efidp_ipv6_addr' size-in-bits='360' is-struct='yes' naming-typedef-id='type-id-123' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='463' column='1' id='type-id-124'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='460' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='local_ipv6_addr' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='461' column='1'/>
+        <var-decl name='local_ipv6_addr' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='remote_ipv6_addr' type-id='type-id-63' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='462' column='1'/>
+        <var-decl name='remote_ipv6_addr' type-id='type-id-64' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='288'>
-        <var-decl name='local_port' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='463' column='1'/>
+        <var-decl name='local_port' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='304'>
-        <var-decl name='remote_port' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='464' column='1'/>
+        <var-decl name='remote_port' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='468' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='protocol' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='465' column='1'/>
+        <var-decl name='protocol' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='469' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='336'>
-        <var-decl name='ip_addr_origin' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='466' column='1'/>
+        <var-decl name='ip_addr_origin' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='470' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='344'>
-        <var-decl name='prefix_length' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='467' column='1'/>
+        <var-decl name='prefix_length' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='471' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='352'>
-        <var-decl name='gateway_ipv6_addr' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='468' column='1'/>
+        <var-decl name='gateway_ipv6_addr' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='472' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-123' filepath='src/include/efivar/efivar-dp.h' line='469' column='1' id='type-id-122'/>
-    <class-decl name='efidp_vlan' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-124' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='476' column='1' id='type-id-125'>
+    <typedef-decl name='efidp_ipv6_addr' type-id='type-id-124' filepath='src/include/efivar/efivar-dp.h' line='473' column='1' id='type-id-123'/>
+    <class-decl name='efidp_vlan' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-125' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='480' column='1' id='type-id-126'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='477' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='481' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vlan_id' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='478' column='1'/>
+        <var-decl name='vlan_id' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_vlan' type-id='type-id-125' filepath='src/include/efivar/efivar-dp.h' line='479' column='1' id='type-id-124'/>
-    <class-decl name='efidp_infiniband' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-126' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='482' column='1' id='type-id-127'>
+    <typedef-decl name='efidp_vlan' type-id='type-id-126' filepath='src/include/efivar/efivar-dp.h' line='483' column='1' id='type-id-125'/>
+    <class-decl name='efidp_infiniband' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-127' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='486' column='1' id='type-id-128'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='483' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='resource_flags' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='484' column='1'/>
+        <var-decl name='resource_flags' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='port_gid' type-id='type-id-61' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='485' column='1'/>
+        <var-decl name='port_gid' type-id='type-id-62' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='489' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='' type-id='type-id-128' visibility='default'/>
+        <var-decl name='' type-id='type-id-129' visibility='default'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='target_port_id' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1'/>
+        <var-decl name='target_port_id' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='494' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='device_id' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='491' column='1'/>
+        <var-decl name='device_id' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='495' column='1'/>
       </data-member>
     </class-decl>
-    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='486' column='1' id='type-id-128'>
+    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='490' column='1' id='type-id-129'>
       <data-member access='public'>
-        <var-decl name='ioc_guid' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='487' column='1'/>
+        <var-decl name='ioc_guid' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='491' column='1'/>
       </data-member>
       <data-member access='public'>
-        <var-decl name='service_id' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='488' column='1'/>
+        <var-decl name='service_id' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='492' column='1'/>
       </data-member>
     </union-decl>
-    <typedef-decl name='efidp_infiniband' type-id='type-id-127' filepath='src/include/efivar/efivar-dp.h' line='492' column='1' id='type-id-126'/>
-    <class-decl name='efidp_uart' size-in-bits='152' is-struct='yes' naming-typedef-id='type-id-129' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='501' column='1' id='type-id-130'>
+    <typedef-decl name='efidp_infiniband' type-id='type-id-128' filepath='src/include/efivar/efivar-dp.h' line='496' column='1' id='type-id-127'/>
+    <class-decl name='efidp_uart' size-in-bits='152' is-struct='yes' naming-typedef-id='type-id-130' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='505' column='1' id='type-id-131'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='502' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='506' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='503' column='1'/>
+        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='baud_rate' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='504' column='1'/>
+        <var-decl name='baud_rate' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='508' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='data_bits' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='505' column='1'/>
+        <var-decl name='data_bits' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='509' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='136'>
-        <var-decl name='parity' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='506' column='1'/>
+        <var-decl name='parity' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='510' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='stop_bits' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='507' column='1'/>
+        <var-decl name='stop_bits' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='511' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_uart' type-id='type-id-130' filepath='src/include/efivar/efivar-dp.h' line='508' column='1' id='type-id-129'/>
-    <class-decl name='efidp_msg_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-131' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='532' column='1' id='type-id-132'>
+    <typedef-decl name='efidp_uart' type-id='type-id-131' filepath='src/include/efivar/efivar-dp.h' line='512' column='1' id='type-id-130'/>
+    <class-decl name='efidp_msg_vendor' size-in-bits='160' is-struct='yes' naming-typedef-id='type-id-132' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='536' column='1' id='type-id-133'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='533' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='537' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='534' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='538' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='vendor_data' type-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='535' column='1'/>
+        <var-decl name='vendor_data' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='539' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_msg_vendor' type-id='type-id-132' filepath='src/include/efivar/efivar-dp.h' line='536' column='1' id='type-id-131'/>
-    <class-decl name='efidp_uart_flow_control' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-133' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='545' column='1' id='type-id-134'>
+    <typedef-decl name='efidp_msg_vendor' type-id='type-id-133' filepath='src/include/efivar/efivar-dp.h' line='540' column='1' id='type-id-132'/>
+    <class-decl name='efidp_uart_flow_control' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-134' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='549' column='1' id='type-id-135'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='546' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='550' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='547' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='551' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='flow_control_map' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='548' column='1'/>
+        <var-decl name='flow_control_map' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='552' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-134' filepath='src/include/efivar/efivar-dp.h' line='549' column='1' id='type-id-133'/>
-    <class-decl name='efidp_sas' size-in-bits='352' is-struct='yes' naming-typedef-id='type-id-135' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='556' column='1' id='type-id-136'>
+    <typedef-decl name='efidp_uart_flow_control' type-id='type-id-135' filepath='src/include/efivar/efivar-dp.h' line='553' column='1' id='type-id-134'/>
+    <class-decl name='efidp_sas' size-in-bits='352' is-struct='yes' naming-typedef-id='type-id-136' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='560' column='1' id='type-id-137'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='557' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='vendor_guid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='558' column='1'/>
+        <var-decl name='vendor_guid' type-id='type-id-39' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='559' column='1'/>
+        <var-decl name='reserved' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='sas_address' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='560' column='1'/>
+        <var-decl name='sas_address' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='564' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='lun' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='561' column='1'/>
+        <var-decl name='lun' type-id='type-id-43' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='565' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='device_topology_info' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='562' column='1'/>
+        <var-decl name='device_topology_info' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='566' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='328'>
-        <var-decl name='drive_bay_id' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='563' column='1'/>
+        <var-decl name='drive_bay_id' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='567' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='336'>
-        <var-decl name='rtp' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='564' column='1'/>
+        <var-decl name='rtp' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='568' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sas' type-id='type-id-136' filepath='src/include/efivar/efivar-dp.h' line='565' column='1' id='type-id-135'/>
-    <class-decl name='efidp_sas_ex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-137' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='589' column='1' id='type-id-138'>
+    <typedef-decl name='efidp_sas' type-id='type-id-137' filepath='src/include/efivar/efivar-dp.h' line='569' column='1' id='type-id-136'/>
+    <class-decl name='efidp_sas_ex' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-138' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='593' column='1' id='type-id-139'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='590' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='594' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='sas_address' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='591' column='1'/>
+        <var-decl name='sas_address' type-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='lun' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='592' column='1'/>
+        <var-decl name='lun' type-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='596' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='device_topology_info' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='593' column='1'/>
+        <var-decl name='device_topology_info' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='597' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='168'>
-        <var-decl name='drive_bay_id' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='594' column='1'/>
+        <var-decl name='drive_bay_id' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='598' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='176'>
-        <var-decl name='rtp' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='595' column='1'/>
+        <var-decl name='rtp' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='599' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sas_ex' type-id='type-id-138' filepath='src/include/efivar/efivar-dp.h' line='596' column='1' id='type-id-137'/>
-    <class-decl name='efidp_iscsi' size-in-bits='144' is-struct='yes' naming-typedef-id='type-id-139' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='602' column='1' id='type-id-140'>
+    <typedef-decl name='efidp_sas_ex' type-id='type-id-139' filepath='src/include/efivar/efivar-dp.h' line='600' column='1' id='type-id-138'/>
+    <class-decl name='efidp_iscsi' size-in-bits='144' is-struct='yes' naming-typedef-id='type-id-140' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='606' column='1' id='type-id-141'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='603' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='protocol' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='604' column='1'/>
+        <var-decl name='protocol' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='48'>
-        <var-decl name='options' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='605' column='1'/>
+        <var-decl name='options' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='609' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='lun' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='606' column='1'/>
+        <var-decl name='lun' type-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='610' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='tpgt' type-id='type-id-51' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='607' column='1'/>
+        <var-decl name='tpgt' type-id='type-id-52' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='611' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='144'>
-        <var-decl name='target_name' type-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='608' column='1'/>
+        <var-decl name='target_name' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='612' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_iscsi' type-id='type-id-140' filepath='src/include/efivar/efivar-dp.h' line='609' column='1' id='type-id-139'/>
-    <class-decl name='efidp_nvme' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-141' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='637' column='1' id='type-id-142'>
+    <typedef-decl name='efidp_iscsi' type-id='type-id-141' filepath='src/include/efivar/efivar-dp.h' line='613' column='1' id='type-id-140'/>
+    <class-decl name='efidp_nvme' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-142' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='641' column='1' id='type-id-143'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='638' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='642' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='namespace_id' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='639' column='1'/>
+        <var-decl name='namespace_id' type-id='type-id-37' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='643' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='ieee_eui_64' type-id='type-id-70' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='640' column='1'/>
+        <var-decl name='ieee_eui_64' type-id='type-id-71' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='644' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_nvme' type-id='type-id-142' filepath='src/include/efivar/efivar-dp.h' line='641' column='1' id='type-id-141'/>
-    <class-decl name='efidp_uri' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-143' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='646' column='1' id='type-id-144'>
+    <typedef-decl name='efidp_nvme' type-id='type-id-143' filepath='src/include/efivar/efivar-dp.h' line='645' column='1' id='type-id-142'/>
+    <class-decl name='efidp_uri' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-144' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='650' column='1' id='type-id-145'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='647' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='651' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='uri' type-id='type-id-72' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='648' column='1'/>
+        <var-decl name='uri' type-id='type-id-73' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_uri' type-id='type-id-144' filepath='src/include/efivar/efivar-dp.h' line='649' column='1' id='type-id-143'/>
-    <class-decl name='efidp_ufs' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-145' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='652' column='1' id='type-id-146'>
+    <typedef-decl name='efidp_uri' type-id='type-id-145' filepath='src/include/efivar/efivar-dp.h' line='653' column='1' id='type-id-144'/>
+    <class-decl name='efidp_ufs' size-in-bits='48' is-struct='yes' naming-typedef-id='type-id-146' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='658' column='1' id='type-id-147'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='653' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='target_id' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='654' column='1'/>
+        <var-decl name='target_id' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='40'>
-        <var-decl name='lun' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='655' column='1'/>
+        <var-decl name='lun' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='661' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_ufs' type-id='type-id-146' filepath='src/include/efivar/efivar-dp.h' line='656' column='1' id='type-id-145'/>
-    <class-decl name='efidp_sd' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-147' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='659' column='1' id='type-id-148'>
+    <typedef-decl name='efidp_ufs' type-id='type-id-147' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-146'/>
+    <class-decl name='efidp_sd' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-148' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1' id='type-id-149'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='660' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='slot_number' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='661' column='1'/>
+        <var-decl name='slot_number' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='667' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_sd' type-id='type-id-148' filepath='src/include/efivar/efivar-dp.h' line='662' column='1' id='type-id-147'/>
-    <class-decl name='efidp_bt' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-149' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='665' column='1' id='type-id-150'>
+    <typedef-decl name='efidp_sd' type-id='type-id-149' filepath='src/include/efivar/efivar-dp.h' line='668' column='1' id='type-id-148'/>
+    <class-decl name='efidp_bt' size-in-bits='80' is-struct='yes' naming-typedef-id='type-id-150' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1' id='type-id-151'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='666' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='addr' type-id='type-id-68' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='667' column='1'/>
+        <var-decl name='addr' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='673' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_bt' type-id='type-id-150' filepath='src/include/efivar/efivar-dp.h' line='668' column='1' id='type-id-149'/>
-    <class-decl name='efidp_wifi' size-in-bits='288' is-struct='yes' naming-typedef-id='type-id-151' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='671' column='1' id='type-id-152'>
+    <typedef-decl name='efidp_bt' type-id='type-id-151' filepath='src/include/efivar/efivar-dp.h' line='674' column='1' id='type-id-150'/>
+    <class-decl name='efidp_wifi' size-in-bits='288' is-struct='yes' naming-typedef-id='type-id-152' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1' id='type-id-153'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='672' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='ssid' type-id='type-id-65' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='673' column='1'/>
+        <var-decl name='ssid' type-id='type-id-66' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='679' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_wifi' type-id='type-id-152' filepath='src/include/efivar/efivar-dp.h' line='674' column='1' id='type-id-151'/>
-    <class-decl name='efidp_emmc' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-153' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='677' column='1' id='type-id-154'>
+    <typedef-decl name='efidp_wifi' type-id='type-id-153' filepath='src/include/efivar/efivar-dp.h' line='680' column='1' id='type-id-152'/>
+    <class-decl name='efidp_emmc' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-154' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='683' column='1' id='type-id-155'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='678' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='684' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='slot' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='679' column='1'/>
+        <var-decl name='slot' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='685' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_emmc' type-id='type-id-154' filepath='src/include/efivar/efivar-dp.h' line='680' column='1' id='type-id-153'/>
-    <class-decl name='efidp_btle' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-155' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='685' column='1' id='type-id-156'>
+    <typedef-decl name='efidp_emmc' type-id='type-id-155' filepath='src/include/efivar/efivar-dp.h' line='686' column='1' id='type-id-154'/>
+    <class-decl name='efidp_btle' size-in-bits='88' is-struct='yes' naming-typedef-id='type-id-156' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='691' column='1' id='type-id-157'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='686' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='692' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='addr' type-id='type-id-68' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='687' column='1'/>
+        <var-decl name='addr' type-id='type-id-69' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='693' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='80'>
-        <var-decl name='addr_type' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='688' column='1'/>
+        <var-decl name='addr_type' type-id='type-id-42' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='694' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='efidp_btle' type-id='type-id-156' filepath='src/include/efivar/efivar-dp.h' line='689' column='1' id='type-id-155'/>
-    <class-decl name='efidp_dns' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-157' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='695' column='1' id='type-id-158'>
+    <typedef-decl name='efidp_btle' type-id='type-id-157' filepath='src/include/efivar/efivar-dp.h' line='695' column='1' id='type-id-156'/>
+    <class-decl name='efidp_dns' size-in-bits='40' is-struct='yes' naming-typedef-id='type-id-158' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='701' column='1' id='type-id-159'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='header' type-id='type-id-75' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='696' column='1'/>
+        <var-decl name='header' type-id='type-id-76' visibility='default' filepath='src/include/efivar/efivar-dp.h' line='702' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
